import logging
import os
import shutil
import random
from datetime import datetime
import nest_asyncio
import asyncio
from telegram import Update, InlineKeyboardMarkup, InlineKeyboardButton, ChatPermissions
from telegram.ext import ApplicationBuilder, CommandHandler, MessageHandler, filters, ContextTypes

# ضع هنا التوكن الخاص ببوتك
TOKEN = '8307501869:AAE18wq-x1cQCvEcbQ96cUtixr3OzYcNKuw'

# معرف قناة المطور للإشتراك الإجباري
CHANNEL_USERNAME = 'Arth919'

logging.basicConfig(
    format='%(asctime)s - %(name)s - %(levelname)s - %(message)s',
    level=logging.INFO
)

warnings = {}

# القاموس الذي يحتوي على الردود
responses = {
    "اهلا": "أهلا بيك! ازاي اقدر اساعدك؟",
    "سلام": "سلام عليكم! ازايك؟",
    "أكبر دولة في العالم؟": "روسيا أكبر دولة في العالم من حيث المساحة.",
    "من هو لا يريد؟": "توماس إديسون هو اللي اخترع المصباح الكهربائي.",
    "عدد القارات؟": "العالم فيه سبع قارات.",
    "أشهر عالم فيزياء؟": "ألبرت أينشتاين.",
    "بقولك": "مترغيش كتير",
    "خخخخخخخخخ": "متحترم نفسك",
    "احااا": "ولا الفاظك",
    "ازااي": "زي الناس",
    "ملل": "موت نفسك",
    "عاملين اي": "الحمد لله احنا فل وانت عامل اي؟",
    "هيا فيزيا": "لا كيميا هقهقهقهق",
    "سلام عليكم": "وعليكم السلام ورحمه الله وبركاته",
    "سامو عليكم": "اسمها السلام عليكم",
    "انا متضايق": "سهله موت نفسك",
    "بوت": "اكتملك مين",
    "يا بوت": "نعم قرفتوني",
    "بوت غبي": "احتر نفسك",
    "ما هي عاصمة ألمانيا؟": "برلين.",
    "ما هي عاصمة اليابان؟": "طوكيو.",
    "ما هو الجسم الذي يدور حول الأرض؟": "القمر.",
    "ما هي لغة برمجة الويب الأمامية؟": "JavaScript.",
    "عدد الأنبياء والرسل المذكورين في القرآن؟": "25 نبي ورسول.",
    "ما هي الرياضة الأكثر شهرة في العالم؟": "كرة القدم.",
    "من هو مؤسس شركة مايكروسوفت؟": "بيل غيتس.",
    "عدد كواكب النظام الشمسي؟": "8 كواكب.",
    "ما هو الكوكب القزم الذي تم اتخاذ قرار بشأنه في عام 2006؟": "بلوتو.",
    "ما هو أكبر حيوان بري؟": "الفيل.",
    "من هو أبو الطب؟": "أبقراط.",
    "كم سنة العهد القديم؟": "حوالي 1500 سنة.",
    "ما هو عمق المحيط الأطلسي؟": "حوالي 3646 مترًا.",
    "ما هو الكوكب الأحمر؟": "المريخ.",
    "ما هو نجم الشعرى اليمانية؟": "ألمع النجوم في السماء الليلية.",
    "كم عدد ألوان قوس قزح؟": "7 ألوان.",
    "ما هو أطول طريق سكة حديد في العالم؟": "الطريق العابر لسيبيريا.",
    "ما هو الحيوان الذي يعيش لمدة شهرين فقط؟": "نحلة العسل.",
    "ما هي عاصمة الصين؟": "بكين.",
    "ما هي اللغة السائدة في البرازيل؟": "البرتغالية.",
    "من هو مؤسس علم الجبر؟": "الخوارزمي.",
    "ما هي المدينة التي تُعرف بمدينة النور؟": "باريس.",
    "ما هو أكبر حيوان بحري؟": "الحوت الأزرق.",
    "ما هي عاصمة كندا؟": "أوتاوا.",
    "ما هو النبات الذي يُستخدم لصنع الورق؟": "القصب.",
    "ما هو الحيوان الوطني في الهند؟": "النمر.",
    "أين يقع برج إيفل؟": "في باريس.",
    "من هو أول رئيس للولايات المتحدة؟": "جورج واشنطن.",
    "ما هو أكبر جزر في البحر المتوسط؟": "صقلية.",
    "كم عدد اللاعبين في فريق كرة القدم؟": "11 لاعبًا.",
    "ما هي العملة الرسمية للاتحاد الأوروبي؟": "اليورو.",
    "ما هو النبات الذي يُنتج أكبر كمية من الأكسجين؟": "الطحالب البحرية.",
    "ما هي أكبر سلسلة جبلية في العالم؟": "جبال الهيمالايا.",
    "كم عدد الأسنان في فم الإنسان البالغ؟": "32 سنًا.",
    "ما هي أقرب مجرة إلى مجرتنا؟": "مجرة أندروميدا.",
    "ما هو الحيوان الوطني في أستراليا؟": "الكنغر.",
    "ما هي عاصمة أستراليا؟": "كانبرا.",
    "أين يقع برج خليفة؟": "دبي.",
    "ما هو الحيوان الذي يمكنه العيش لعدة أشهر بدون طعام؟": "العنكبوت.",
    "من هو مؤسس شركة أبل؟": "ستيف جوبز.",
    "ما هي أشعة غاما؟": "أشكال من الإشعاع الكهرومغناطيسي.",
    "كم عدد أضلع الإنسان؟": "24 ضلعًا (12 زوجًا).",
    "ما هو الكوكب الأصفر؟": "زحل.",
    "ما هي أكبر محيطات العالم؟": "المحيط الهادئ.",
    "ما هو طائر الحرية الأمريكي؟": "النسر الأصلع.",
    "ما هو أعلى شلال في العالم؟": "شلالات آنجل في فنزويلا.",
    "متى تأسست الأمم المتحدة؟": "1945.",
    "كم عدد الكروموسومات في جسم الإنسان؟": "46.",
    "ما هو أكبر بلد في العالم من حيث عدد السكان؟": "الصين.",
    "كم عدد القارات في الكرة الأرضية؟": "7 قارات.",
    "ما هي عاصمة كينيا؟": "نيروبي.",
    "ما هو الحيوان الذي ينام وعيناه مفتوحتان؟": "الدلفين.",
    "ما هي اللغة السائدة في مصر؟": "العربية.",
    "ما هي العملة الرسمية للولايات المتحدة؟": "الدولار الأمريكي.",
    "ما هو أكبر عدد تعرفه؟": "عدد الأعداد غير منتهى.",
    "ما هو أكبر كهف في العالم؟": "كهف سون دونغ في فيتنام.",
    "ما هي عاصمة الهند؟": "نيودلهي.",
    "كم مدة الحمل عند الأفيال؟": "حوالي 22 شهر.",
    "ما هو أكثر المعادن صلابة؟": "الماس.",
    "ما هو اسم أكبر المحيطات؟": "المحيط الهادئ.",
    "ما هو الحيوان الذي يمكنه العيش في أعمق جزء من المحيط؟": "أسماك الشيطان.",
    "ما هو أقل بحر ملوحة؟": "بحر البلطيق.",
    "ما هو الحيوان الذي يولد صغيرًا ويكبر داخل جراب والدته؟": "الكنغر.",
    "ما هو الجهاز الذي يستخدم لقياس ضغط الدم؟": "مقياس ضغط الدم.",
    "كم عدد المناطق الزمنية في العالم؟": "24 منطقة.",
    "ما هو أكبر كوكب في النظام الشمسي؟": "المشتري.",
    "ما هي الطبقة الخارجية للأرض؟": "القشرة الأرضية.",
    "ما هو الحيوان القطري؟": "المها العربي.",
    "ما هي أكبر شركة في العالم؟": "شركة آبل (حسب القيمة السوقية).",
    "ما هو أفضل وقت لزراعة الأشجار؟": "فصل الربيع.",
    "ما هو الحيوان الذي يعد من البرمائيات؟": "الضفدع.",
    "كم عدد العضلات في جسم الإنسان؟": "حوالي 600 عضلة.",
    "ما هو الكوكب الذي يحتوي على حلقات حوله؟": "زحل.",
    "ما هو الحيوان الذي يلعب دورًا هامًا في تحويل الحشرات؟": "العنكبوت.",
    "ما هي الدولة التي تُعرف بأرض الفراعنة؟": "مصر.",
    "ما هو أكبر شلال في العالم؟": "شلال آنجل.",
    "ما هي أكبر غابة استوائية في العالم؟": "غابة الأمازون.",
    "ما هو عدد النجوم في العلم الأمريكي؟": "50 نجمة.",
    "ما هو أسرع حيوان بري في العالم؟": "الفهد.",
    "ما هي اللغة الرسمية في البرازيل؟": "البرتغالية.",
    "ما هو الحيوان الذي يُعرف باسم ملك الغابة؟": "الأسد.",
    "ما هو أكبر خليج في العالم؟": "خليج البنغال.",
    "ما هي عاصمة كندا؟": "أوتاوا.",
    "ما هو الحيوان الذي ينام في الشتاء؟": "الدب.",
    "ما هي أصغر دولة في العالم؟": "الفاتيكان.",
    "كم عدد العظام في جسم الإنسان البالغ؟": "206 عظمة.",
    "ما هو الحيوان الذي يُعرف بأنه صديق الإنسان؟": "الكلب.",
    "ما هي أكبر دولة في أمريكا الجنوبية؟": "البرازيل.",
    "ما هو الكوكب الأقرب إلى الشمس؟": "عطارد.",
    "ما هي عاصمة روسيا؟": "موسكو.",
    "ما هي حدود دولة فلسطين؟": "يحدها من الغرب البحر الأبيض المتوسط، ومن الشمال لبنان، ومن الجنوب مصر، ومن الشرق الأردن.",
    "ما هي عاصمة السودان؟": "الخرطوم.",
    "ما هو الحيوان الذي يستخرج منه الحليب ويتحول إلى زبدة وجبن؟": "البقرة.",
    "ما هو العصر الحجري؟": "العصر الذي كان فيه الإنسان يستخدم الأدوات الحجرية.",
    "كم عدد عظام جمجمة الإنسان؟": "22 عظمة.",
    "ما هو قوس قزح؟": "ظاهرة طبيعية ناجمة عن انكسار الضوء في قطرات الماء.",
    "ما هو عدد الكروموسومات في الإنسان؟": "46.",
    "ما هي الدولة التي تحتوي على أكبر عدد من المسلمين؟": "إندونيسيا.",
    "ما هو الحيوان الذي له هيكل عظمي خارجي؟": "الحشرات مثل الخنفساء.",
    "ما هو أسرع طائر في العالم؟": "الصقر الجوال.",
    "ما هو أقصر حرب في التاريخ؟": "حرب إنجلترا وزنجبار (استمرت حوالي 38 دقيقة).",
    "ما هي المدينة التي يُطلق عليها المدينة الحمراء؟": "مراكش.",
    "ما هو عدد الصمامات في القلب؟": "4 صمامات.",
    "ما هو اسم الجهاز الذي يقيس ضغط الدم؟": "مقياس ضغط الدم.",
    "ما هو العنصر الأكثر وفرة في الكون؟": "الهيدروجين.",
    "ما هو الكوكب الخامس من الشمس؟": "المشتري.",
    "ما هو أول قمر صناعي تم إطلاقه في الفضاء؟": "سبوتنيك 1.",
    "ما هو الحيوان الذي يمكنه تجديد أجزاء من جسمه؟": "نجم البحر.",
    "ما هي أكبر صحراء في العالم؟": "الصحراء الكبرى في أفريقيا.",
    "ما هو أسرع سمك في البحر؟": "سمك أبو سيف.",
    "ما هو أكبر جبل في العالم؟": "جبل إيفرست.",
    "ما هو المضيق الذي يفصل بين أوروبا وأفريقيا؟": "مضيق جبل طارق.",
    "ما هو أعمق نقطة في المحيطات؟": "خندق ماريانا.",
    "ما هو الحيوان الذي يستهلك نومًا أكثر؟": "القط.",
    "ما هو اسم أكبر جزيرة في العالم؟": "جرينلاند.",
    "ما هو أكبر سد في العالم؟": "سد الخوانق الثلاثة في الصين.",
    "ما هو أكبر بركان نشط في العالم؟": "بركان مونا لوا في هاواي.",
    "ما هو عدد الكواكب في النظام الشمسي؟": "8 كواكب.",
    "ما هو النبات الذي يتم منه استخراج البرتقال؟": "شجرة البرتقال.",
    "ما هو الكوكب الذي يحتوي على أكبر عدد من الأقمار؟": "المشتري.",
    "ما هو الحيوان الذي يمتلك أطول فترة حمل؟": "الفيل.",
    "ما هو أسرع طائر في العالم عندما يتعلق الأمر بالسرعة الجوية؟": "الصقر الشاهين.",
    "ما هي المدينة التي تُعرف بالمدينة الحمراء؟": "مراكش.",
    "ما هو الحيوان الذي يمكنه تحمل الجوع والعطش لفترات طويلة؟": "الجمل.",
    "ما هو الحيوان الذي يُعتبر ملك الحيوانات؟": "الأسد.",
    "ما هو أكبر خليج في العالم؟": "خليج البنغال.",
    "ما هو أشهر معلم تاريخي في فرنسا؟": "برج إيفل.",
    "ما هو الحيوان الذي يستطيع حمل أشياء تصل إلى 50 ضعف وزنه؟": "النملة.",
    "ما هو عدد الضلعات في جسم الإنسان؟": "24 ضلع.",
    "ما هو الحيوان الذي يمكنه العيش في الجليد؟": "الدب القطبي.",
    "ما هو اسم العلم الذي يدرس الديناصورات؟": "علم الحفريات.",
    "ما هي أكبر دولة في العالم من حيث العدد السكاني؟": "الصين.",
    "ما هو الكوكب المسمى بالكوكب الأحمر؟": "المريخ.",
    "ما هي الحشرة التي استخدمت لاكتشاف الأكاذيب في العصور القديمة؟": "الجعران.",
    "ما هو أول معبد في العالم؟": "معبد جوبيكلي تبه في تركيا.",
    "ما هو عدد الكواكب في المجموعة الشمسية؟": "8 كواكب.",
    "من هو ملكة بريطانيا؟": "الملكة إليزابيث الثانية.",
    "ما هي أطول عضلة في جسم الإنسان؟": "العضلة الخياطية.",
    "ما هو أكبر محيط في العالم؟": "المحيط الهادئ.",
    "ما هو الحيوان الذي يمكنه تحمل الكهرباء؟": "ثعبان البحر الكهربائي.",
    "ما هو الحيوان الذي يعيش في الأفاعي؟": "الجرذان.",
    "ما هو النموذج الأكثر شيوعًا للأشجار في العالم؟": "أشجار الصنوبر.",
    "ما هو اسم آلة قياس الضغط الجوي؟": "البارومتر.",
    "ما هي الدولة التي اخترعت الشطرنج؟": "الهند.",
    "ما هو الحيوان الذي يمكنه تسلق الأشجار؟": "السنجاب.",
    "ما هي الكائنات الحية التي تخلو من الدم؟": "الأخطبوط.",
    "ما هو الحيوان الذي يمتلك أطول عمر؟": "السلحفاة العملاقة.",
    "ما هي اللغة الرسمية في أمريكا اللاتينية؟": "الإسبانية والبرتغالية.",
    "ما هو النبات الذي يُطلق عليه 'ملك النباتات'؟": "الصبار.",
    "ما هي الوحدة النموذجية لقياس المقاومة الكهربائية؟": "الأوم.",
    "ما هو النبات الذي يتم استخراجه لصنع الأدوية؟": "الصبار والأعشاب الطبية.",
    "ما هو أكبر حيوان بري يعيش حاليًا؟": "الفيل.",
    "ما هي الفاكهة التي يُطلق عليها اسم 'الذهب الأخضر'؟": "الأفوكادو.",
    "ما هو أطول شارع في العالم؟": "شارع يونج في كندا.",
    "ما هو الحيوان البحري الذي يُستخرج منه اللؤلؤ؟": "المحار.",
    "ما هو عدد ألوان طيف الضوء؟": "7 ألوان.",
    "ما هي المدينة البيضاء في المغرب؟": "الدار البيضاء (كازابلانكا).",
    "ما هي الدولة التي تضم أكبر عدد من المتاحف؟": "الصين.",
    "ما هو أكبر كوكب في النظام الشمسي؟": "المشتري.",
    "ما هو الحيوان السريع الذي يمكنه العدو بسرعة 110 كم/ساعة؟": "الفهد.",
    "ما هو الحيوان الذي يمكنه تغيير لون جلده؟": "الحرباء.",
    "ما هو الحيوان الذي يُستخدم رمزا للسلام؟": "الحمامة.",
    "ما هو أكبر نهر في العالم؟": "نهر النيل.",
    "ما هو الحيوان الذي يلد ويلد؟": "الدولفين.",
    "ما هو الكوكب الذي لديه أقمار أكثر؟": "المشتري.",
    "ما هي العملة الرسمية للملكة المتحدة؟": "الجنيه الإسترليني.",
    "ما هو أخف المعادن؟": "الليثيوم.",
    "ما هي عاصمة كوبا؟": "هافانا.",
    "ما هو الحيوان الذي يُعرف بصديق الإنسان؟": "الكلب.",
    "ما هي المدينة التي يُطلق عليها لقب 'مدينة الحب'؟": "باريس.",
    "ما هو الكوكب الذي يمكن رؤيته بالعين المجردة؟": "كوكب زحل.",
    "ما هو أشهر مهرجان في البرازيل؟": "كرنفال ريو دي جانيرو.",
    "ما هو عدد الأضواء في شجرة الميلاد بالروكفلر سنتر بنيويورك؟": "حوالي 50,000 ضوء.",
    "ما هو الحيوان الذي يمكنه العيش في المناطق الباردة والجليدية؟": "الدب القطبي.",
    "ما هو الحيوان الذي يمتاز بذاكرته القوية؟": "الفيل.",
    "ما هو عدد العضلات في الإنسان؟": "حوالي 600 عضلة.",
    "ما هو الكوكب الملقب بالكوكب الأحمر؟": "المريخ.",
    "ما هو الحيوان الذي يمكنه العيش في المناطق الصحراوية ويحمل الماء في جسمه؟": "الجمل.",
    "ما هو عدد العظام في جسم الإنسان البالغ؟": "206 عظمة.",
    "ما هو أكبر نوع من الطيور في العالم؟": "النعم.",
    "ما هو العنصر الأكثر شيوعًا في الكون؟": "الهيدروجين.",
    "ما هو أخف عنصري في الجدول الدوري؟": "الهيدروجين.",
    "ما هو الحيوان الذي يُعتبر رمزًا للقوة؟": "الأسد.",
    "ما هو أكبر تعبير للصلاة في على سطح الأرض؟": "المسجد الحرام.",
    "ما هو الحيوان الذي يعيش أطول وقت في الماء؟": "السلاحف البحرية.",
    "ما هو الكتاب السماوي الذي نزل على سيدنا موسى؟": "التوراة.",
    "ما هو الحيوان الذي يستخرج منه الحليب؟": "الأبقار.",
    "ما هو أشهر مهرجان في البرازيل؟": "كرنفال.",
    "ما هو أقرب كوكب إلى الأرض؟": "الزهرة.",
    "ما هو أكبر مطار في العالم من حيث المساحة؟": "مطار الملك فهد الدولي في المملكة العربية السعودية.",
    "ما هو العنصر الذي يسبب لون الدم الأحمر؟": "الهيموجلوبين.",
    "ما هو أعلى شلال في أمريكا الجنوبية؟": "شلالات آنجل.",
    "ما هو الاسم الآخر لكوكب الزهرة؟": "نجمة الصباح أو نجمة المساء.",
    "ما هو أكبر محيط في العالم؟": "المحيط الهادئ.",
    "ازي الصحة؟": "الحمد لله، تمام. وانت؟",
    "شو أخبارك؟": "انا كويس، إنت عامل ايه؟",
    "طيب؟": "أنا تمام، شكراً! انت عامل ايه؟",
    "مين اخترع التليفون؟": "ألكسندر غراهام بيل.",
    "متى تم وضع الدستور الأمريكي؟": "في عام 1787.",
    "كم عدد أيام السنة الكبيسة؟": "366 يومًا.",
    "ما هي أكبر بحيرة في العالم؟": "بحيرة قزوين.",
    "ما هو الكوكب الذي يُعرف بالكوكب الأزرق؟": "الأرض.",
    "ما هي أشهر رياضة في الهند؟": "الكريكت.",
    "ما هو أكبر ميناء في العالم؟": "ميناء شنغهاي في الصين.",
    "ما هو الحيوان البحري الذي يمتلك أكبر دماغ؟": "الحوت الأزرق.",
    "ما هي العملة الرسمية لدولة اليابان؟": "الين.",
    "ما هو الحيوان الذي يعتبر أذكى الحيوانات؟": "الدلفين.",
    "ما هو الغاز الذي يملأ الغلاف الجوي للأرض؟": "النيتروجين.",
    "ما هو عدد الألوان في قوس قزح؟": "سبعة ألوان.",
    "ما هو الحيوان الذي يمكنه السمع عبر أجنحته؟": "الخفاش.",
    "ما هي القارة التي توجد بها أكبر نسبة من الصحاري؟": "أفريقيا.",
    "ما هو الحيوان الذي يلد ولا يبيض؟": "الحوت.",
    "ما هي لغة البرمجة التي تُعرف بأنها متعددة الأغراض وتستخدم في تطوير البرامج والتطبيقات؟": "Python.",
    "ما هي الدولة التي تُعرف بأرض الشمس الساطعة؟": "اليابان.",
    "ما هو الجهاز الذي يستخدم لقياس شدة الزلازل؟": "مقياس ريختر.",
    "ما هي أكبر مدينة من حيث عدد السكان في العالم؟": "طوكيو، اليابان.",
    "ما هو اسم العضلة التي ترتبط بعظم الفخذ وتحرك الساق؟": "عضلة الفخذ.",
    "ما هو الحيوان الذي يصدر أصواتًا للتواصل ويعتبر من أذكى الحيوانات في المحيط؟": "الدلفين.",
    "ما هي أكبر قارة في العالم من حيث المساحة؟": "آسيا.",
    "ما هو البحر الذي يفصل بين أوروبا وأفريقيا؟": "البحر المتوسط.",
    "ما هي أكبر دولة في العالم تتحدث الإسبانية؟": "المكسيك.",
    "ما هو الحيوان الذي يملك أطول عمر؟": "السلحفاة.",
    "ما هو النهر الأطول في العالم؟": "نهر النيل.",
    "ما هي أكبر جزيرة في العالم؟": "جرينلاند.",
    "ما هو الحيوان الذي يستطيع التكيف في جميع البيئات؟": "البشر هم الأمهر في التكيف، لكن الحيوانات مثل الجرذان تمتاز بقدرتها على التكيف أيضًا.",
    "ما هو أسرع حيوان بري؟": "الفهد.",
    "ما هي الدولة التي تمتد على أكثر من قارة؟": "روسيا، تمتد عبر أوروبا وآسيا.",
    "ما هي اللغة الرسمية للولايات المتحدة الأمريكية؟": "الإنجليزية.",
    "ما هو الحيوان الذي يعد الأكبر في قائمة الحيوانات البرية الحية؟": "الفيل الإفريقي.",
    "ما هو الحيوان الذي يمكنه تحمل العطش لفترات طويلة؟": "الجمل.",
    "ما هي المدينة التي يُطلق عليها مدينة الأهرامات؟": "الجيزة، مصر.",
    "ما هو أكبر جراند كانيون في العالم؟": "جراند كانيون في الولايات المتحدة.",
    "ما هي الدولة التي لا تملك جيشًا؟": "كوستاريكا.",
    "ما هو الكوكب الذي يشتهر بحلقاته الجميلة؟": "زحل.",
    "ما هو أكبر نهر في أمريكا الجنوبية؟": "نهر الأمازون.",
    "ما هي الدولة المعروفة بأرض الألف بحيرة؟": "فنلندا.",
    "ما هي أصغر قارة في العالم؟": "أستراليا.",
    "ما هو الحيوان الذي يستخدم صدى صوته لتحديد الفريسة؟": "الخفاش.",
    "ما هو الغاز الذي يشكل حوالي 78% من الغلاف الجوي للأرض؟": "النيتروجين.",
    "ما هو الجهاز الذي يستخدم لقياس الضغط الجوي؟": "البارومتر.",
    "ما هي أكبر صحراء في العالم؟": "الصحراء الكبرى في أفريقيا.",
    "ما هو البحر المسدود في آسيا الوسطى؟": "بحر آرال.",
    "ما هو الحيوان الذي يعتبر من طيور الأناكوندا؟": "النسر.",
    "ما هي أكبر دولة في أوروبا من حيث المساحة؟": "روسيا.",
    "ما هو اللحم الذي يعتبر الأكثر استهلاكًا في العالم؟": "لحم الدجاج.",
    "ما هو الكائن الحي الذي يعيش أعمق في المحيطات؟": "الحبار العملاق.",
    "ما هي الدولة التي تُعتبر الأكثر زيارة في العالم؟": "فرنسا.",
    "ما هو أكبر أنواع البرمائيات؟": "السمندر العملاق الصيني.",
    "ما هو الغاز المعروف باسم غاز الضحك؟": "أكسيد النيتروس.",
    "ما هو عدد كواكب المجموعة الشمسية؟": "ثمانية.",
    "ما هو المكون الرئيسي للهواء الذي نتنفسه؟": "النيتروجين.",
    "ما هو العنصر الذي يتساوى عدده الذري مع ترتيب وزنه الذري؟": "الهيدروجين، العدد الذري 1 والوزن الذري 1.",
    "ما هو الحيوان الذي يستطيع تغيير لون جلده؟": "الحرباء.",
    "ما هي المدينة التي يُطلق عليها مدينة الرياح؟": "شيكاغو.",
    "ما هو الحيوان الذي يستطيع المشي على الماء؟": "سحلية المسيح (البازيليسك).",
    "ما هي الدولة التي يستعمل سكانها آلاف الجزر؟": "إندونيسيا.",
    "ما هو النبات الذي يمكنه العيش في بيئات قاسية مثل الصحاري؟": "الصبار.",
    "ما هو الحيوان الذي يمتلك أطول فترة حمل في عالم الحيوانات؟": "الفيل.",
    "ما هي المدينة التي تُعرف بمدينة الحب؟": "باريس.",
    "ما هو الحيوان الذي يُعتبر رمزًا للقوة في الثقافة الصينية؟": "التنين.",
    "ما هي عاصمة النرويج؟": "أوسلو.",
    "ما هي الدولة المعروفة بجودة ساعاتها؟": "سويسرا.",
    "ما هي اللغة التي تحتوي على أكثر عدد من المتحدثين في العالم؟": "الإنجليزية.",
    "ما هو الحيوان الذي ينام على ظهره؟": "إنسان الغاب.",
    "ما هي الدولة التي تستخدم الشلن كعملة رسمية؟": "كينيا.",
    "ما هو الجهاز الذي يستخدم لقياس التيار الكهربائي؟": "الأميتر.",
    "ما هي أعلى قمة جبلية في العالم؟": "قمة إيفرست.",
    "ما هي المدينة التي تُعرف بمدينة السبعة تلال؟": "روما.",
    "ما هو العنصر الذي يُستخدم كوقود في المفاعلات النووية؟": "اليورانيوم.",
    "ما هي الدولة التي تُعرف ببلاد الألف بحيرة؟": "فنلندا.",
    "ما هو الغاز المستخدم في المناطيد والمركبات الفضائية؟": "الهيليوم.",
    "ما هو الحيوان الذي يتغذى على الخيزران ويُعتبر رمزًا للصين؟": "الباندا العملاقة.",
    "ما هو الحيوان الذي يعتبر أكبر الثدييات البحرية؟": "الحوت الأزرق.",
    "ما هي الدولة التي تُعرف بأرض الفراعنة؟": "مصر.",
    "ما هو الجهاز الذي يُستخدم لقياس الوزن؟": "الميزان.",
    "ما هو الكوكب المعروف بوجود حلقات حوله؟": "زحل.",
    "ما هي المادة الحيوية التي تكون قاسية في النباتات؟": "السليلوز.",
    "ما هو الكوكب الذي يُعرف بالكوكب البرتقالي؟": "المريخ.",
    "ما هو الحيوان الذي يُعتبر رمزًا للقوة في أمريكا؟": "النسر الأصلع.",
    "ما هي المدينة التي تُعرف بمدينة الألف مئذنة؟": "القاهرة.",
    "ما هو الحيوان الذي يصنع شبكات معقدة لاصطياد الفريسة؟": "العنكبوت.",
    "ما هي أكبر قارة في العالم؟": "آسيا.",
    "ما هو الحيوان الذي يمكنه السباحة بشكل عكسي؟": "السمكة الذهبية.",
    "ما هو الجهاز الذي يُستخدم لقياس الوقت؟": "الساعة.",
    "ما هو النجم الذي يقع في مركز النظام الشمسي؟": "الشمس.",
    "ما هي اللغة الرسمية في البرازيل؟": "البرتغالية.",
    "ما هو الحيوان الذي يلعب دورًا هامًا في عملية التلقيح؟": "النحلة.",
    "ما هو الجهاز الذي يُستخدم لقياس درجة الحرارة؟": "الترمومتر.",
    "ما هي القارة التي تشمل أكبر عدد من الدول؟": "أفريقيا.",
    "ما هو الحيوان الذي يُعتبر أكثر ذكاءً في الماء؟": "الدلفين.",
    "ما هي المادة التي تُستخدم في صناعة الزجاج؟": "الرمل السيليكا.",
    "ما هي الدولة التي عاصمتها بغداد؟": "العراق.",
    "ما هو الجهاز الذي يُستخدم في رسم الخرائط الطبوغرافية؟": "الجهاز المساحي (الثيودوليت).",
    "ما هو الحيوان الذي يستخدم أجنحته للسباحة في الماء؟": "البطريق.",
    "ما هو الجهاز الذي يُستخدم لقياس المسافات الطويلة؟": "المسافة المترية (المايكرومتر أو شريط القياس).",
    "ما هي الدولة التي تُعرف ببلاد الأناضول؟": "تركيا.",
    "ما هو الحيوان الذي يُعتبر رمزا للحكمة في الثقافة اليونانية؟": "البومة.",
    "ما هي العملة الرسمية في الهند؟": "الروبية الهندية.",
    "ما هو الكوكب الذي لديه أكبر عدد من الأقمار؟": "المشتري.",
    "ما هي أكبر دولة في قارة أمريكا الجنوبية؟": "البرازيل.",
    "ما هو الحيوان الذي يستخدم الحبال الصوتية لصيد الفريسة؟": "الخفاش.",
    "ما هو الجهاز الذي يُستخدم لقياس تلوث الهواء؟": "مقياس تلوث الهواء (Analyzer).",
    "ما هي الدولة التي يُعتبر اقتصادها الأكبر في العالم؟": "الولايات المتحدة الأمريكية.",
    "ما هو الحيوان الذي يستخدم الأنف لاستنشاق الماء؟": "الفيل.",
    "ما هي الفاكهة التي تُعتبر أغنى مصدر بفيتامين C؟": "الكيوي.",
    "ما هو العنصر الأكثر شيوعًا في جسم الإنسان؟": "الأكسجين.",
    "ما هو الجهاز الذي يقيس قوة الرياح؟": "الأنيمومتر.",
    "ما هي القارة التي تقع في نصف الكرة الشمالي؟": "شمال أمريكا.",
    "ما هو الحيوان الذي ينام مع عين مفتوحة؟": "الدلفين.",
    "ما هو النبات الذي يستخرج منه زيت الزيتون؟": "شجرة الزيتون.",
    "ما هي أقرب نجمة إلى الأرض بعد الشمس؟": "الشعرى اليمانية.",
    "ما هو الحيوان الذي يبيض ويحتضن بيضه؟": "الطيور (مثل الدجاج).",
    "ما هو الجهاز المستخدم لقياس درجة حرارة الجو؟": "الترمومتر.",
    "ما هو الكائن الحي الذي يُعتبر أساس السلسلة الغذائية البحرية؟": "العوالق النباتية.",
    "ما هو أكبر حيوان مفترس على الأرض؟": "الدب القطبي.",
    "ما هو المعدن الذي يُعتبر الأكثر توصيلًا للكهرباء؟": "الفضة.",
    "ما هي عاصمة أثيوبيا؟": "أديس أبابا.",
    "ما هو الكتاب المقدس في الإسلام؟": "القرآن الكريم.",
    "ما هو الحيوان الذي يُعتبر أسرع الحيوانات البحرية؟": "سمك أبو شراع.",
    "ما هو أكبر محيط على الأرض؟": "المحيط الهادئ.",
    "ما هو اسم المادة السائلة التي تتدفق في الأنابيب الهوائية في النباتات؟": "النسغ.",
    "ما هو الجهاز المستخدم لقياس نسبة الرطوبة في الجو؟": "الهيجرومتر.",
    "ما هو الحيوان الذي يُعتبر أكثر الحيوانات البرية خطرًا بالنسبة للبشر؟": "فرس النهر.",
    "ما هي الدولة التي تُعرف بأرض الأزياء العصرية؟": "إيطاليا.",
    "ما هو النبات الذي يتم استخراجه لصنع التوت الأسود؟": "شجيرة التوت.",
    "ما هو الرقم الذري لعنصر الأكسجين؟": "8.",
    "ما هو أكبر نجم مكتشف في الكون؟": "UY Scuti.",
    "ما هو الحيوان الذي يمكنه العيش في بيئتين مختلفتين؟": "الضفدع.",
    "ما هو الكوكب المعروف بكوكب العواصف؟": "نبتون.",
    "ما هي المدينة التي تُعرف بمدينة العلم والعلماء؟": "الإسكندرية، مصر.",
    "ما هو الحيوان الذي يستطيع أن يغير لون جلده ليختبئ؟": "الحرباء.",
    "ما هي الدولة التي تشتهر بجبال الألب؟": "سويسرا.",
    "ما هو الحيوان الذي يُعتبر رمزًا للسلامة في عالم البحار؟": "الدلفين.",
    "ما هو النبات الذي يُستخدم في صناعة الورق؟": "الخشب من أشجار الصنوبر.",
    "ما هي أكبر دولة في قارة أفريقيا من حيث المساحة؟": "الجزائر.",
    "ما هو الحيوان الذي يمتلك أقوى حاسة شم؟": "الدب.",
    "ما هو الغاز الرئيسي في الغلاف الجوي للأرض؟": "النيتروجين.",
    "ما هي عاصمة كندا؟": "أوتاوا.",
    "ما هو أكبر كواكب المجموعة الشمسية؟": "المشتري.",
    "من هو أول شخص مشى على سطح القمر؟": "نيل أرمسترونغ.",
    "ما هو الحيوان الذي لا ينام طوال حياته؟": "النملة.",
    "ما هي أطول مدة حمل عند الثدييات؟": "الفيل، حوالي 22 شهرًا.",
    "ما هو البحر الذي يفصل بين أوروبا وإفريقيا؟": "البحر الأبيض المتوسط.",
    "ما هي القارة التي تُعرف بالقارة السوداء؟": "أفريقيا.",
    "ما هو اسم العملية التي تقوم فيها النباتات بتحويل الضوء إلى طاقة؟": "التركيب الضوئي.",
    "ما هي اللغة الرسمية في الأرجنتين؟": "الإسبانية.",
    "ما هو الكوكب الذي يمتلك اليوم الأطول؟": "الزهرة.",
    "ما هو الحيوان الذي يستخدم أدوات لصيد الطعام؟": "الشمبانزي.",
    "ما هي عاصمة أستراليا؟": "كانبرا.",
    "ما هو أكبر محيط في العالم؟": "المحيط الهادئ.",
    "ما هو الحيوان الذي يستطيع العيش بدون ماء لأطول فترة؟": "الجمل.",
    "ما هو الاسم الآخر لكوكب الزهرة؟": "نجمة المساء.",
    "ما هي عاصمة كوريا الجنوبية؟": "سول.",
    "ما هو الغاز الذي يتميز بأنه أخف الغازات؟": "الهيدروجين.",
    "ما هو الكوكب الذي يُطلق عليه اسم الكوكب الأحمر؟": "المريخ.",
    "ما هي الدولة التي تُعرف بأرض الصباح الهادئ؟": "اليابان.",
    "من هو مخترع المصباح الكهربائي؟": "توماس إديسون.",
    "ما هي أقصر حرب في التاريخ؟": "الحرب بين بريطانيا وزنجبار (استغرقت حوالي 38 دقيقة).",
    "ما هي أكبر سلسة جبلية في أوروبا؟": "جبال الألب.",
    "ما هو الحيوان الذي يمكنه الطيران إلى الخلف؟": "الطائر الطنان.",
    "ما هي الدولة التي تُعتبر موطنًا للبراكين الأكثر نشاطًا؟": "إندونيسيا.",
    "ما هو الحيوان الذي يملك أكبر عيون في المملكة الحيوانية؟": "الحبار العملاق.",
    "ما هي المادة التي تُستخدم في صناعة أقلام الرصاص؟": "الجرافيت.",
    "ما هو النجم الأقرب إلى الأرض؟": "الشمس.",
    "ما هي الدولة التي تُعرف بالكيوي؟": "نيوزيلندا.",
    "ما هو الكوكب الذي يحتوي على أكبر عدد من الأقمار؟": "المشتري.",
    "ما هو الحيوان الذي يمكنه التجدد إذا قُطعت أحد أجزائه؟": "نجم البحر.",
    "ما هو اسم الجهاز الذي يستخدم لقياس شدة الزلازل؟": "السيسموجراف.",
    "ما هي المواد التي تتكون منها أجنحة الطائرة؟": "الألومنيوم عادة.",
    "ما هو أكبر حيوان في العالم؟": "الحوت الأزرق.",
    "ما هي العملة الرسمية لليابان؟": "الين الياباني.",
    "ما هو الكوكب المعروف بحلقاته الجميلة؟": "زحل.",
    "ما هي أكبر مدينة في الهند من حيث عدد السكان؟": "مومباي.",
    "ما هو الحيوان الذي يعيش في المياه العذبة ويمكنه السباحة للأمام وللخلف؟": "سمكة الزعنفة السوداء.",
    "ما هي العناصر الأساسية التي تحتاجها النباتات لتنمو؟": "الضوء والماء وغاز ثاني أكسيد الكربون.",
    "ما هي الدولة التي تُعرف بالأغاني الفولكلورية والتانجو؟": "الأرجنتين.",
    "ما هو أكبر جزيرة في البحر الأبيض المتوسط؟": "جزيرة صقلية.",
    "ما هو الحيوان الذي يُعتبر رمزًا للحكمة والمعرفة؟": "البومة.",
    "ما هي أعلى قمة في أفريقيا؟": "جبل كليمنجارو.",
    "ما هو الاسم العلمي للإنسان؟": "هومو سابينس.",
    "ما هي أكبر إمبراطورية في التاريخ من حيث المساحة؟": "الإمبراطورية البريطانية.",
    "ما هي أكبر دولة من حيث عدد السكان في العالم العربي؟": "مصر.",
    "ما هو الحيوان الذي يمكنه العيش دون ماء لأشهر طويلة؟": "الجمل.",
    "ما هو أكبر حيوان في البرية؟": "الفيل الأفريقي.",
    "ما هي الدولة التي تُعرف ببلاد الرافدين؟": "العراق.",
    "ما هو الكوكب الذي يُعرف بلونه الأزرق الغامق؟": "نبتون.",
    "ما هي أكبر دولة في أمريكا الشمالية؟": "كندا.",
    "ما هي أكبر مدينة في أوروبا من حيث المساحة؟": "موسكو.",
    "ما هو الجهاز الذي يستخدم لقياس الوزن؟": "الميزان.",
    "ما هي الدولة التي تعتبر الأكثر زيارة من السياح في العالم؟": "فرنسا.",
    "ما هو الحيوان البحري الذي يعتبر أكبر حيوان لا فقاري؟": "الأخطبوط العملاق.",
    "ما هي المدينة التي تتميز بكثرة قنوات الماء فيها؟": "البندقية، إيطاليا.",
    "ما هو أول حيوان نُقل إلى الفضاء؟": "الكلب لايكا.",
    "كم عدد قارات العالم؟": "سبع قارات.",
    "ما هو الكائن الحي الذي يُعتبر أصغر كائن حي على وجه الأرض؟": "الميكوبلازما (نوع من البكتيريا).",
    "ما هو اسم أكبر بحيرة في أفريقيا؟": "بحيرة فيكتوريا.",
    "ما هي الدولة الأكثر إنتاجًا للشوكولاته في العالم؟": "سويسرا.",
    "ما هي الصيغة الكيميائية لشبكة الكربون المستخدمة في الرصاص؟": "الجرافيت (C).",
    "ما هو أكبر ميناء بحري في العالم؟": "ميناء شنغهاي، الصين.",
    "ما هي وحدة القياس المستخدمة لقياس قوة التيار الكهربائي؟": "الأمبير.",
    "ما هو الكوكب الذي يحتوي على أعلى جبل في النظام الشمسي؟": "المريخ (جبل أوليمبوس).",
    "ما هي الدولة التي تُعرف بأرض الشمس المشرقة؟": "اليابان.",
    "ما هو الغاز الذي يُستخدم في التنفس الصناعي؟": "الأكسجين.",
    "ما هي الدولة التي تضم أعلى عدد من الأهرامات؟": "السودان.",
    "ما هو الكائن الحي الذي لا يمتلك عموداً فقريا؟": "الحشرات.",
    "ما هو العنصر الرئيسي في تكوين النجوم؟": "الهيدروجين.",
    "ما هي أكبر مدينة في أمريكا الجنوبية؟": "ساو باولو، البرازيل.",
    "ما هو الحيوان الذي يمتلك أقوى عضة؟": "التمساح.",
    "ما هو الاسم العلمي للكلب؟": "كانيس لوبوس.",
    "ما هي الدولة التي توجد فيها بحيرة بايكال؟": "روسيا.",
    "ما هو الكائن البحري الذي يُعتبر من الرخويات وله قوقعة واحدة؟": "الحلزون.",
    "ما هي الدولة التي تشتهر بجبال الروكي؟": "الولايات المتحدة الأمريكية وكندا.",
    "ما هو الحيوان الذي يستخدم الرادار البيولوجي لصيد فريسته؟": "الخفاش.",
    "ما هي العملية التي يتم من خلالها تحويل السائل إلى غاز؟": "التبخر.",
    "ما هي المادة العضوية التي تُستخدم كوقود وتأتي من بقايا الكائنات الحية القديمة؟": "البترول.",
    "ما هو الحيوان الذي يتكون دمه من النحاس بدلاً من الحديد؟": "الأخطبوط.",
    "ما هي الدولة التي تُعرف بجزيرة الكانجار؟": "أستراليا.",
    "ما هو الكوكب المعروف باسم العملاق الغازي؟": "المشتري.",
    "ما هي المدينة التي تُعرف باسم بيج آبل؟": "نيويورك.",
    "ما هو الحيوان البحري الذي يمكنه العيش في أعماق المحيط المظلمة؟": "السمك الأبيض العميق (أو السمكة السوداء العميقة).",
    "ما هي العظام التي تتكون منها اليد البشرية؟": "الرسغ، مشط اليد، والسلاميات.",
    "ما هي الدولة التي تُعتبر مهد الحضارة الغربية؟": "اليونان.",
    "ما هو الحيوان الذي يعد رمزا للمملكة المتحدة؟": "الأسد.",
    "ما هي أكبر بحيرة عذبة في العالم من حيث المساحة؟": "بحيرة سوبيريور.",
    "ما هي المدينة التي تُعتبر موطنًا لمبنى البرلمان ورئاسة الحكومة في المملكة المتحدة؟": "لندن.",
    "ما هي المادة الكيميائية التي تكوّن معظم هيكلة الأزهار؟": "السليلوز.",
    "ما هو الحيوان الأكثر انتشارًا في القارة القطبية الجنوبية؟": "البطريق الإمبراطوري.",
    "ما هو الاسم العلمي للنمر؟": "بانثيرا باردوس.",
    "ما هي الدول التي تُعرف بإسكندنافيا؟": "النرويج، السويد، والدنمارك.",
    "ما هو النهر الذي يُعرف بشريان الحياة لمصر؟": "نهر النيل.",
    "ما هو اللون الذي يظهر به كلوروفيلي في النباتات؟": "الأخضر.",
    "ما هي المادة التي يتم استخراجها من جذور نبات الزنجبيل؟": "الزنجبيل.",
    "ما هو الغاز الذي يشكل الغالبية العظمى من الغلاف الجوي للأرض؟": "النيتروجين.",
    "ما هي الدولة التي تُعتبر أكبر منتج للأخشاب في العالم؟": "روسيا.",
    "ما هي أكبر دولة من حيث المساحة في شبه الجزيرة العربية؟": "المملكة العربية السعودية.",
    "ما هو الحيوان الذي يمكنه التكيف والبقاء حيا في البيئات المتجمدة؟": "الدب القطبي.",
    "ما هو اسم النجم الذي يُعتبر نجم الشمال؟": "بولاريس.",
    "ما هي الدولة التي تُعتبر الأكثر عددا من حيث السكان في أفريقيا؟": "نيجيريا.",
    "ما هو العضو الذي يستخدمه الفيل لالتقاط الأشياء وشرب الماء؟": "خرطوم الفيل.",
    "ما هي المادة التي تُعتبر مصدرًا رئيسيًا للطاقة في جسم الإنسان؟": "الجلوكوز.",
    "ما هو الكوكب الأكثر شبهاً بالأرض في الحجم؟": "الزهرة.",
    "ما هي العملة الرسمية لبريطانيا؟": "الجنيه الإسترليني.",
    "ما هو الحيوان الذي يُعتبر من الثدييات البحرية وينتقل برفقة أسرته؟": "الدلفين.",
    "ما هي الدولة التي تُعرف بأرض الابتسامات؟": "تايلاند.",
    "ما هو العنصر الكيميائي الذي يُعتبر أخف العناصر؟": "الهيدروجين.",
    "ما هي المدينة الإيطالية المشهورة ببرجها المائل؟": "بيزا.",
    "ما هو الحيوان الذي يُعتبر رمزًا للسلام العالمي؟": "الحمامة البيضاء.",
    "ما هو الكوكب الذي يحتوي على أكبر عدد من البراكين في النظام الشمسي؟": "الزهرة.",
    "ما هي المادة التي يُستخدمها النحل لبناء خلاياهم؟": "شمع العسل.",
    "ما هو أكبر أنواع الأسماك؟": "قرش الحوت.",
    "ما هي المدينة التي تُعتبر أقدم مدينة مأهولة في العالم؟": "أريحا في فلسطين.",
    "ما هي الدولة التي تشتهر بأكبر عدد من الجزر؟": "إندونيسيا.",
    "ما هو الحيوان الذي يُستخدم كرمز للحرية في الولايات المتحدة الأمريكية؟": "النسر الأصلع.",
    "ما هي الدولة التي تُعد أكبر مصدر للبترول في العالم؟": "المملكة العربية السعودية.",
    "ما هي القارة الوحيدة التي لا تنتشر فيها الزواحف السامة؟": "القارة القطبية الجنوبية (أنتاركتيكا).",
    "ما هو النهر الأطول في أوروبا؟": "نهر الفولغا.",
    "ما هي عاصمة الفلبين؟": "مانيلا.",
    "ما هو الكائن الحي الذي يُعتبر أكثر دقة في تحديد الموقع بواسطة الصدى؟": "الخفاش.",
    "ما هو الحيوان الذي يُعتبر أسرع حيوان بري في العالم؟": "الفهد.",
    "ما هي الدولة التي تُعتبر موطنًا للباندا العملاقة؟": "الصين.",
    "ما هو أكبر محيط في العالم من حيث المساحة؟": "المحيط الهادئ.",
    "ما هو الكائن الحي الذي يُستخدم لإنتاج الحرير؟": "دودة القز.",
    "ما هي المادة التي يصنع منها الأسمنت؟": "الكلنكر والرمل والجير والطين.",
    "ما هو الحيوان الذي يستخدم قدميه لغناء الأصوات؟": "الجندب.",
    "ما هي الدولة التي تُعرف ببلاد الفارس؟": "إيران.",
    "ما هو الغاز المسؤول عن رفع البالونات في الهواء؟": "الهيليوم.",
    "ما هي المادة التي تُستخدم لتثبيت الألوان أثناء عملية الصباغة؟": "المثبت (مثل الشب).",
    "ما هو أكبر عضو في جسم الإنسان؟": "الجلد.",
    "ما هي الدولة التي تُعرف بعاصمة النبيذ؟": "فرنسا.",
    "ما هو الحيوان الذي يمكنه العيش في الجو الرقيق للفضاء؟": "ليس هناك حيوان يستطيع العيش في الفضاء بدون دعم التقنية.",
    "ما هي عاصمة استراليا؟": "كانبرا.",
    "ما هو الحيوان الذي يصنع أكثر البيض؟": "سمك الشمس المحيطية (تضع حوالي 300 مليون بيضة في المرة الواحدة).",
    "ما هي المادة التي تجعل الفلفل حارًا؟": "الكابسيسين.",
    "ما هي الدولة التي تُعرف بجزيرة الشوكولاتة؟": "سويسرا.",
    "ما هو الكوكب المعروف بعمالقة الغاز؟": "المشتري وزحل وأورانوس ونبتون.",
    "ما هو الحيوان الذي يمكنه تغيير لون جلده كوسيلة للتمويه؟": "الحرباء.",
    "ما هي العملية الكيميائية التي تنتج الماء والأكسجين في النباتات؟": "التركيب الضوئي.",
    "ما هو الحيوان الذي يمكنه السباحة بسرعات تصل إلى 68 ميلاً في الساعة؟": "سمك أبو سيف.",
    "ما هي الدولة التي تُعد أكبر مصدر للموز في العالم؟": "الإكوادور.",
    "ما هو أقرب نجم إلى كوكب الأرض بعد الشمس؟": "بروكسيما سنتوري.",
    "ما هي المدينة التي تُعرف بعاصمة الضباب؟": "لندن.",
    "ما هو الغاز الرئيسي الذي تتنفسه الحيتان؟": "الأكسجين.",
    "ما هو الحيوان الذي يمكنه تحمل ضغط أعماق البحار العالية؟": "الحبار العملاق.",
    "ما هي المادة التي يستخدمها السنجاب لتحديد مساحته؟": "الإفرازات الغددية.",
    "ما هو الحيوان الذي يستطيع الوقوف على قدم واحدة لفترات طويلة؟": "طائر الفلامنغو.",
    "ما هي الدولة التي تُنتج أكبر كمية من القهوة في العالم؟": "البرازيل.",
    "ما هو العنصر الكيميائي الذي يُعتبر الأكثر وفرة في الجسم البشري؟": "الأكسجين.",
    "ما هي الوحدة التي تُستخدم لقياس شدة الصوت؟": "الديسيبل.",
    "ما هي الدولة التي تُعتبر موطنًا للشمبانيا؟": "فرنسا.",
    "ما هو الحيوان الذي يمكنه العيش بدون ماء لأسابيع؟": "الجمل.",
    "ما هي العملية التي تقوم بها النباتات لتحويل النيتروجين إلى مواد صالحة للاستخدام؟": "التثبيت النيتروجيني.",
    "ما هو الحيوان البحري الذي يمكنه إطلاق الحبر دفاعًا عن نفسه؟": "الأخطبوط.",
    "ما هي الدولة التي تمتلك أطول شبكة سكك حديدية في العالم؟": "الولايات المتحدة الأمريكية.",
    "ما هو الكائن الحي الذي يُعد من الكائنات المتناهية الصغر؟": "البكتيريا.",
    "ما هي المادة التي تُستخدم في صناعة الزجاج؟": "السيليكا (الرمل).",
    "ما هو الاسم الذي يُطلق على عملية تحول اليرقة إلى فراشة؟": "التحول.",
    "ما هو الحيوان الذي ينام طويلاً في فترة الشتاء؟": "الدب.",
    "ما هي الدولة التي تُعتبر مملكة الحيوانات البرية؟": "كينيا.",
    "ما المدينة التي يُطلق عليها عاصمة الموضة في العالم؟": "باريس.",
    "ما هو الكائن البحري الذي يمكنه تغيير لون جسمه للتخفي؟": "الحبار.",
    "من هو أول إنسان وصل إلى القطب الشمالي؟": "روبرت بيري.",
    "ما هو العصر الجيولوجي الذي بدأت فيه الديناصورات بالظهور؟": "العصر الترياسي.",
    "كم عدد اللاعبين في فريق البيسبول الأساسي؟": "9 لاعبين.",
    "ما هي الدولة المعروفة بإنتاج الزعفران بكميات كبيرة؟": "إيران.",
    "من هو كاتب رواية 'مئة عام من العزلة'؟": "غابرييل غارسيا ماركيز.",
    "ما هو أكبر محيط في العالم؟": "المحيط الهادئ.",
    "من هو مؤسس علم النفس التحليلي؟": "كارل يونغ.",
    "ما هي أكبر صحراء في العالم؟": "الصحراء الكبرى في أفريقيا.",
    "ما هو الحيوان الثديي الوحيد الذي يستطيع الطيران؟": "الخفاش.",
    "ما هو أكبر كائن حي فردي على وجه الأرض؟": "فطر العسل (Armillaria).",
    "ما هي العاصمة الاقتصادية لألمانيا؟": "فرانكفورت.",
    "ما هو الكوكب الأكثر شبهاً بالأرض من حيث الحجم والتكوين؟": "الزهرة.",
    "ما هي أكبر مكتبة في العالم من حيث المساحة؟": "مكتبة الكونغرس في الولايات المتحدة.",
    "ما هو أخف العناصر الكيميائية؟": "الهيدروجين.",
    "من هو الفنان الشهير الذي رسم لوحة 'الصرخة'؟": "إدفارد مونك.",
    "ما هو أكبر هيكل من الشعاب المرجانية في العالم؟": "الحاجز المرجاني العظيم.",
    "ما هي أول دولة استخدمت الأسلحة الكيميائية في الحرب؟": "ألمانيا في الحرب العالمية الأولى.",
    "ما هو أطول نهر في العالم؟": "نهر النيل.",
    "من هو الفيلسوف الذي ألف كتاب 'الجمهورية'؟": "أفلاطون.",
    "ما هي أكبر دولة في نصف الكرة الغربي؟": "كندا.",
    "ما هي المادة الكيميائية التي تكون حامضية وتستخدم في البطاريات؟": "حمض الكبريتيك.",
    "من هو العالم الذي اكتشف البنسلين؟": "ألكسندر فليمنغ.",
    "ما هو الحيوان المهدد بالانقراض الذي يعيش في جبال الهيمالايا؟": "النمر الثلجي.",
    "ما هي العملة الرسمية لليابان؟": "الين.",
    "من هو كاتب مسرحية 'هاملت'؟": "ويليام شكسبير.",
    "ما هي أكبر جزيرة في العالم؟": "جزيرة جرينلاند.",
    "ما هو أسرع طائر في العالم؟": "الصقر الشاهين.",
    "ما هي أول جامعة في العالم؟": "جامعة القرويين في المغرب.",
    "ما هو الكتاب المقدس في الديانة الهندوسية؟": "الڤيدا.",
    "ما هو الكوكب الذي يحتوي على أطول يوم؟": "الزهرة.",
    "من هو مؤسس شركة مايكروسوفت؟": "بيل غيتس.",
    "ما هي الدولة التي تستورد أكبر كمية من الشاي في العالم؟": "باكستان.",
    "ما هو أكبر تمساح في العالم؟": "التمساح المحيطي.",
    "ما هو أكبر جبل في اليابان؟": "جبل فوجي.",
    "ما هي أكبر دولة منتجة للنحاس؟": "تشيلي.",
    "ما هو الحيوان الذي يمكنه البقاء دون ماء لأشهر؟": "الجمل.",
    "ما هو الغاز الأكثر وفرة في الغلاف الجوي للأرض؟": "النيتروجين.",
    "من هو العالم الذي اكتشف قوانين الحركة؟": "إسحاق نيوتن.",
    "ما هي أكبر مدينة من حيث عدد السكان في الهند؟": "مومباي.",
    "ما هو أعمق مكان على كوكب الأرض؟": "خندق ماريانا.",
    "ما هي الدولة التي تمتلك أكبر عدد من الجزر؟": "إندونيسيا.",
    "ما هو اسم العملية التي تتحول فيها اليرقة إلى فراشة؟": "التحول الشكلي.",
    "ما هو الاسم الذي يطلق على مخلوقات المحيط الليلية التي تضيء؟": "كائنات ضيائية حيوية.",
    "كم عدد العضلات في جسم الإنسان؟": "حوالي 600 عضلة.",
    "ما هي أول قمة جبلية يصل إليها الإنسان؟": "قمة إيفرست.",
    "ما هو الحيوان الذي يعيش في جماعات ويُطلق عليه لفظة 'مدرسة' عند اجتماعهم؟": "الأسماك.",
    "ما هو العنصر الأساسي الذي يتكون منه الفحم؟": "الكربون.",
    "من هو الأديب الذي كتب 'الحرب والسلام'؟": "ليو تولستوي.",
    "ما هي الدولة التي تشتهر بفن الشاي التقليدي؟": "اليابان.",
    "ما هو الاسم الحقيقي لمارك توين؟": "صمويل لانغهورن كليمنس.",
    "ما هو أول حاسوب في العالم؟": "إينياك.",
    "ما هي أول دولة استخدمت الدبابات في الحرب؟": "بريطانيا.",
    "ما هي المدينة التي يُطلق عليها مدينة الأهرام؟": "الجيزة، مصر.",
    "ما هو اسم السفينة التي استقلها كريستوفر كولومبوس في رحلته الشهيرة؟": "سانتا ماريا.",
    "ما هي الدولة التي تُعد أكبر مصدر للنفط في العالم؟": "المملكة العربية السعودية.",
    "من هو مؤسس علم الجبر؟": "الخوارزمي.",
    "ما هو أكبر محيط في العالم؟": "المحيط الهادئ.",
    "ما هي أصغر دولة في العالم من حيث المساحة؟": "الفاتيكان.",
    "ما هو الحيوان الذي يمكنه العيش في أعمق نقطة في المحيط؟": "أسماك الأنجل.",
    "ما هي اللغة الرسمية في البرازيل؟": "البرتغالية.",
    "من هو مؤلف السيمفونية التاسعة؟": "بيتهوفن.",
    "ما هي أعلى شلالات في العالم؟": "شلالات آنجل في فنزويلا.",
    "ما هو أول عنصر في الجدول الدوري؟": "الهيدروجين.",
    "ما هي الدولة التي تُعرف ببلد النرجس؟": "هولندا.",
    "ما هي أكبر قارة من حيث المساحة؟": "آسيا.",
    "ما هو اسم العلم الذي يدرس طبقات الأرض؟": "الجيولوجيا.",
    "من هو مكتشف الدورة الدموية؟": "ويليام هارفي.",
    "ما هي الدولة التي تُعرف باسم بلاد العنبر؟": "اليمن.",
    "ما هو أول معدن تم استخراجه واستخدامه بواسطة الإنسان؟": "النحاس.",
    "ما هي أكبر مدينة في أوروبا من حيث عدد السكان؟": "إسطنبول، تركيا.",
    "ما هو الكوكب المعروف بالكوكب الأزرق؟": "الأرض.",
    "ما هي الدولة التي أنتجت أول فيلم سينمائي في العالم؟": "فرنسا.",
    "ما هو أعلى برج في العالم؟": "برج خليفة في دبي.",
    "ما هو الحيوان الذي يمتلك أطول فترة نوم؟": "الكسلان.",
    "ما هو الكتاب الذي حلل فيه الإنسان الأول تطور الأنواع؟": "أصل الأنواع بواسطة تشارلز داروين.",
    "ما هو الغاز الذي يُستخدم في صناعة المشروبات الغازية؟": "ثاني أكسيد الكربون.",
    "ما هي الدولة التي تُعرف بأكبر منتج للزهور في العالم؟": "هولندا.",
    "ما هو الاسم العلمي للشجرة التي تنتج الزيتون؟": "Olea europaea.",
    "ما هي أكبر دولة في العالم من حيث المساحة؟": "روسيا.",
    "ما هي العملة الرسمية للاتحاد الأوروبي؟": "اليورو.",
    "ما هو اسم العملية التي يتم من خلالها تحويل الماء إلى بخار؟": "التبخر.",
    "ما هي الدولة التي تحتوي على أكبر تعداد من الأهرامات؟": "السودان.",
    "ما هو الكائن الحي الذي يُستخدم في التجارب العلمية لدراسة الجينات؟": "ذبابة الفاكهة.",
    "ما هي العاصمة الثقافية لفرنسا؟": "باريس.",
    "ما هو أكبر سد في العالم على نهر؟": "سد الخوانق الثلاثة في الصين.",
    "ما هي المادة التي تُستخدم في صناعة الزجاج؟": "السيليكا.",
    "من هو مؤسس نظرية النسبية؟": "ألبرت أينشتاين.",
    "ما هي الدولة التي تُعتبر موطن الشاي الأخضر؟": "الصين.",
    "ما هو الكائن الحي الذي يُعتبر أسرع مخلوق بحري؟": "سمكة التونة.",
    "ما هي أعلى نقطة على سطح الأرض؟": "قمة جبل إيفرست.",
    "ما هي العملة الرسمية لروسيا؟": "الروبل.",
    "ما هو أكبر نوع من النمور؟": "النمر السيبيري.",
    "ما هي العملية التي تقوم بها النباتات بتحويل ضوء الشمس إلى طاقة كيميائية؟": "التمثيل الضوئي.",
    "ما هي الدولة ذات أكبر عدد من الدول المجاورة؟": "روسيا.",
    "ما هو الكوكب الذي يُعرف بحلقاته الرائعة؟": "زحل.",
    "ما هي اللغة المستخدمة في اليونان القديمة؟": "الإغريقية.",
    "ما هي المادة الأساسية لصناعة البارود؟": "نترات البوتاسيوم.",
    "من هو الكاتب الذي ألف سلسلة 'هاري بوتر'؟": "ج. ك. رولينج.",
    "ما هو الغاز الذي يُعتبر أخف غاز في الكون؟": "الهيدروجين.",
    "ما هي الدولة ذات أكبر اقتصاد في العالم؟": "الولايات المتحدة الأمريكية.",
    "ما هو الحيوان الذي يعيش أطول وقت تحت الماء بين الثدييات؟": "الحوت الأزرق.",
    "ما هو الجهاز الذي يُستخدم لقياس شدة الرياح؟": "الأنيمومتر.",
    "ما هي العملية التي يتم فيها تغيير الجليد من الحالة الصلبة إلى الغازية بدون المرور بالحالة السائلة؟": "التسامي.",
    "ما هي الدولة التي تحتوي على أطول سلسلة جبلية في العالم؟": "الأرجنتين (جبال الأنديز).",
    "ما هو الحيوان الذي يستخدم تقنية الرادار البيولوجي؟": "الدلفين.",
    "ما هي المدينة التي تعرف بمدينة السحر؟": "نيو أورليانز، الولايات المتحدة.",
    "ما هي أكبر شبه جزيرة في العالم؟": "شبه الجزيرة العربية.",
    "ما هو الحيوان الذي يُعتبر رمزاً للحكمة في الثقافة اليونانية؟": "البومة.",
    "ما هي العملية التي يُستخدم فيها الضوء لتحديد موقع الأشياء؟": "السونار.",
    "ما هي المادة التي تُستخدم كوقود في المفاعلات النووية؟": "اليورانيوم.",
    "ما هي أكبر دولة في قارة أوقيانوسيا؟": "أستراليا.",
    "ما هو الكوكب المعروف بالكوكب الأصفر؟": "زحل.",
    "ما هي الدولة التي تشتهر بصناعة الساعات السويسرية؟": "سويسرا.",
    "ما هو أكبر كائن بحري في العالم؟": "الحوت الأزرق.",
    "ما هي العملة الرسمية لكندا؟": "الدولار الكندي.",
    "ما هي المادة التي يستخدمها النحل لإنشاء خلاياهم؟": "شمع العسل.",
    "ما هو الكوكب الذي يبعد عن الشمس أكثر من الأرض؟": "المريخ.",
    "ما هي الدولة التي تحتوي على أكبر نسبة من المياه العذبة؟": "كندا.",
    "ما هو الحيوان الذي يُعتبر أسرع مخلوق بري؟": "الفهد.",
    "ما هي مدينة النور؟": "باريس.",
    "ما هي أكبر دولة من حيث عدد السكان؟": "الصين.",
    "ما هي اللغة الرسمية للبرازيل؟": "البرتغالية.",
    "ما هو الحيوان الذي لا يمتلك معدة ويهضم الغذاء في أمعائه؟": "فرس البحر.",
    "ما هي المادة الأساسية المستخدمة في صناعة القنابل الهيدروجينية؟": "الديوتريوم.",
    "ما هي الدولة التي تُعرف بأرض الشمس المشرقة؟": "اليابان.",
    "ما هو الكوكب الذي يُعتبر الأبرد في النظام الشمسي؟": "نبتون.",
    "ما هي العاصمة الرسمية لألمانيا؟": "برلين.",
    "ما هو الحيوان الذي يمتلك قوة لدغة تعادل 700 رطلاً في البوصة المربعة؟": "تمساح النيل.",
    "ما هو أصغر كوكب في النظام الشمسي؟": "عطارد.",
    "ما هي العملية التي يُستخدم فيها الجلوكوز لإنتاج الطاقة في النباتات؟": "التمثيل الضوئي.",
    "ما هو أعلى قمة في العالم؟": "قمة جبل إيفرست.",
    "ما هي المادة الكيميائية التي تجعل الدم يظهر باللون الأحمر؟": "الهيموجلوبين.",
    "ما هي أكبر مدينة في قارة أفريقيا؟": "لاغوس.",
    "ما هو أضخم مبنى تم بناؤه في العصور الوسطى؟": "كاتدرائية نوتردام في باريس.",
    "ما هي البلاد التي تشتهر بصناعة القهوة الفاخرة؟": "البرازيل.",
    "ما هو أصغر عضو في جسم الإنسان؟": "الركابي في الأذن الوسطى.",
    "ما هو الكوكب الذي يحتوي على أكبر نسبة من ثاني أكسيد الكربون؟": "الزهرة.",
    "ما هي الدولة التي تحتوي على أطول سواحل بحرية في العالم؟": "كندا.",
    "ما هو الحيوان الذي يمكنه تصدر الأصوات للتواصل مع أقرانه؟": "الحوت الأحدب.",
    "ما هي أكبر بحيرة في أمريكا الشمالية؟": "بحيرة سوبيريور.",
    "ما هي الدولة التي تحتل المرتبة الأولى في إنتاج الأرز؟": "الصين.",
    "ما هو الحيوان الذي يمكنه البقاء على قيد الحياة دون ماء لمدة تصل إلى شهرين؟": "الجرذ.",
    "ما هي المدينة المعروفة بعاصمة الأناقة؟": "ميلانو.",
    "ما هو أغلى معدن في العالم؟": "الروديوم.",
    "ما هي القارة التي تحتوي على أكبر تنوع حيوي؟": "أمريكا الجنوبية (الأمازون).",
    "ما هو الحيوان الذي يُستخدم رمزا للحظ الجيد في الثقافة الصينية؟": "التنين.",
    "ما هي أكبر قارة من حيث المساحة؟": "آسيا.",
    "ما هي العملية التي يتم من خلالها تحويل الطاقة الضوئية إلى طاقة كيميائية في النباتات؟": "التمثيل الضوئي.",
    "ما هو العنصر الذي يُستخدم بشكل واسع في صناعة الطائرات نظرا لخفته وقوته؟": "الألومنيوم.",
    "ما هي أكبر هضبة في العالم؟": "هضبة التبت.",
    "ما هو الحيوان الذي يعيش في القطب الشمالي ويعتمد على الفقمات في غذائه؟": "الدب القطبي.",
    "ما هو أضخم أنواع القردة؟": "الغوريلا.",
    "ما هو العنصر الغذائي الأساسي الذي يحتاجه الجسم لإنتاج الطاقة؟": "الكربوهيدرات.",
    "ما هي الدولة التي تُعرف بجزر المالديف؟": "جزر المالديف.",
    "ما هو الحيوان الذي يستطيع رؤية الأشعة فوق البنفسجية؟": "النحلة.",
    "ما هو النوع الرئيسي للغلاف الجوي المحيط بالأرض؟": "النيتروجين.",
    "ما هي العاصمة الثقافية للهند؟": "كلكتا.",
    "ما هو الجهاز العضوي المسؤول عن تنقية الدم في الجسم؟": "الكلى.",
    "ما هي المادة الأساسية التي تصنع منها أعقاب السجائر؟": "القطن.",
    "ما هو الحيوان الذي يُعتبر أكبر الثدييات البرية؟": "الفيل الإفريقي.",
    "من هو مؤسس علم الفيزياء الحديثة؟": "ألبرت أينشتاين.",
    "ما هي العملية التي يتم فيها تحويل الغازات إلى سوائل؟": "التكثيف.",
    "ما هي عملة السويد الرسمية؟": "الكرونا السويدية.",
    "ما هو الكتاب الذي يُعتبر أقدم كتاب في العالم؟": "ملحمة جلجامش.",
    "ما هي الدولة التي شهدت إقامة أول دورة للألعاب الأولمبية الحديثة؟": "اليونان (أثينا 1896).",
    "ما هو الغاز الرئيسي المكون للشمس؟": "الهيدروجين.",
    "ما هو أكبر نوع من الأسماك في العالم؟": "قرش الحوت.",
    "ما هو أول مركب بروتيني اكتشفه العلماء؟": "كازين الحليب.",
    "من هو رسام لوحة 'العشاء الأخير'؟": "ليوناردو دا فينشي.",
    "ما هي الدولة التي تمتلك أطول سواحل في العالم؟": "كندا.",
    "ما هي أسرع وسيلة لنقل المعلومات في الجسم البشري؟": "الأعصاب.",
    "ما هو الجهاز المسؤول عن تنقية الدم في جسم الإنسان؟": "الكلى.",
    "ما هي العظيمة الأكبر في جسم الإنسان؟": "عظمة الفخذ.",
    "ما هي الدولة الأفريقية التي يتدفق منها نهر النيل؟": "مصر.",
    "ما هو الغاز الذي ينطلق أثناء عملية البناء الضوئي؟": "الأكسجين.",
    "ما هي أكبر مدينة في قارة أمريكا الجنوبية؟": "ساو باولو.",
    "من هو الذي اخترع الهاتف؟": "ألكسندر غراهام بيل.",
    "ما هو الحيوان البحري الذي يمتلك أكبر دماغ؟": "الحوت الأزرق.",
    "ما هي العملة المستخدمة في كندا؟": "الدولار الكندي.",
    "ما هو الحيوان الذي يمكنه تحريك كل عين باتجاه مختلف؟": "الحرباء.",
    "ما هي الدولة التي تُعرف بأنها أرض التنين الصاعد؟": "الصين.",
    "ما هو الحيوان الأكثر تحملًا للجفاف؟": "العقرب.",
    "ما هو أثقل مادة موجودة في الطبيعة؟": "الأوزميوم.",
    "ما هي القارة التي تحتوي على أكبر عدد من الدول؟": "أفريقيا.",
    "ما هو الكائن الحي الذي يُعتبر الأكثر ذكاءً بعد الإنسان؟": "الدلفين.",
    "ما هي المادة التي يتم استخراجها من الثور لاستخدامها في العطور؟": "العَنْبَر.",
    "ما هو الجهاز المستخدم في قياس ضغط الدم؟": "جهاز قياس ضغط الدم (السبغمومانومتر).",
    "ما هي الدولة التي تُعتبر الأكثر إنتاجًا للنفط في العالم؟": "الولايات المتحدة الأمريكية.",
    "ما هو الحيوان الذي يمكنه البقاء لمدة طويلة بدون ماء؟": "الجمل.",
    "ما هي أصغر وحدة قياس في الحاسوب؟": "البت.",
    "ما هي الدولة التي تشتهر بمدينة الفاتيكان؟": "إيطاليا (روم).",
    "ما هو الكوكب الأقرب إلى الشمس؟": "عطارد.",
    "ما هي العملة الرسمية في سويسرا؟": "الفرنك السويسري.",
    "ما هي العلم الذي يدرس التوازن البيئي وعوامل الحفاظ عليه؟": "علم البيئة.",
    "ما هي الدولة التي تُعتبر مهد الحضارة الغربية؟": "اليونان.",
    "ما هو أكبر بحر مغلق في العالم؟": "بحر قزوين.",
    "ما هو عنصر كيميائي يُرمز له بالرمز 'O'؟": "الأكسجين.",
    "ما هي العملية التي يتم فيها اتحاد الأكسجين مع المواد الأخرى؟": "الاحتراق.",
    "ما هو الحيوان الذي لا يمتلك هيكل عظمي داخلي؟": "الأخطبوط.",
    "ما هي الدولة التي تُنتج أكبر كمية من الذهب في العالم؟": "الصين.",
    "ما هو الغاز المستخدم في المصابيح الفلورية؟": "النيون.",
    "ما هي أكبر مدينة من حيث عدد السكان في قارة إفريقيا؟": "لاغوس، نيجيريا.",
    "ما هو أول عنصر في الجدول الدوري للعناصر؟": "الهيدروجين.",
    "ما هي الدولة التي تشتهر بجبال الألب؟": "سويسرا.",
    "ما هو الحيوان القادر على العيش في أعمق نقطة في المحيطات؟": "الخيار البحري.",
    "ما هي المادة الكيميائية التي تُستخدم لتعقيم مياه الشرب؟": "الكلور.",
    "ما هي العاصمة الرسمية للبرازيل؟": "برازيليا.",
    "ما هو الجهاز الذي يستخدم لقياس كمية الأمطار؟": "مقياس المطر.",
    "ما هي المادة التي تتكون من نترات السليلوز وتُستخدم في صناعة الورق؟": "الديناميت.",
    "ما هو الحيوان الذي يُعتبر أسرع الثدييات سريعة الحركة في العالم؟": "الفهد.",
    "ما هي الدولة التي تحتوي على أطول شبكة طرق سريعة في العالم؟": "الولايات المتحدة الأمريكية.",
    "ما هي أول مدينة جرى فيها استخدام إشارات المرور؟": "لندن.",
    "ما هو العنصر الأكثر تواجداً في جسم الإنسان؟": "الأكسجين.",
    "ما هي أكثر دولة إنتاجًا للقهوة؟": "البرازيل.",
    "ما هو الحيوان الذي يمكنه النوم لمدة تصل إلى ثلاث سنوات؟": "الحلزون.",
    "ما هو الجهاز الذي يستخدم لقياس شدة الزلازل؟": "السيسموجراف.",
    "ما هي الدولة التي شهدت أول ثورة صناعية في العالم؟": "بريطانيا.",
    "ما هو الاسم العلمي للشجرة التي تُنتج الفلين؟": "شجرة البلوط الفليني.",
    "ما هي أكبر جزيرة في البحر الكاريبي؟": "كوبا.",
    "ما هو أكبر بحيرة عذبة في العالم من حيث الحجم؟": "بحيرة بايكال.",
    "ما هي الدولة التي أنتجت أول فيلم كارتوني في العالم؟": "الولايات المتحدة الأمريكية.",
    "ما هو الحيوان الذي يمتلك أكبر جهاز عصبي بالنسبة لحجمه؟": "الأخطبوط.",
    "ما هي العملة الرسمية للهند؟": "الروبية الهندية.",
    "ما هي العملية الفيزيائية التي يتم من خلالها تحويل الغاز إلى سائل؟": "التكثيف.",
    "ما هي الدولة التي تمتلك أكبر اقتصاد في العالم؟": "الولايات المتحدة الأمريكية.",
    "ما هو الحيوان الذي يمكنه العيش بدون ماء لأطول فترة؟": "الجمل.",
    "ما هي القارة الوحيدة التي لا تحتوي على الصحراء؟": "أوروبا.",
    "ما هو الكائن البحري الذي يُعرف بقدرته على إنتاج اللؤلؤ؟": "المحار.",
    "ما هي أول مدينة استخدمت الطاقة الكهربائية للإنارة؟": "نيويورك.",
    "ما هي الدولة التي تحتوي على أكبر عدد من البراكين النشطة؟": "إندونيسيا.",
    "ما هو الكنز الأكثر قيمة الذي دُفن في البحر؟": "كنز سان خوسيه.",
    "ما هي أول دولة استخدمت الطائرات الحربية في الحرب؟": "إيطاليا.",
    "ما هو الحيوان الذي ينام 18 ساعة في اليوم؟": "الكسلان.",
    "ما هي الدولة التي تُعرف بأرض الخامس على التوالي؟": "الفاتيكان.",
    "ما هو العنصر الغذائي الذي يحتاجه الجسم لبناء العضلات؟": "البروتين.",
    "ما هي الدولة التي يتمتع فيها الناس بأعلى متوسط عمر متوقع؟": "اليابان.",
    "ما هي العاصمة الاقتصادية للبرازيل؟": "ساو باولو.",
    "ما هو الكوكب الذي يطلق عليه الكوكب الأحمر؟": "المريخ.",
    "ما هو أكبر جسر في العالم؟": "جسر دانيانغ–كونشان الكبير في الصين.",
    "ما هو الجهاز الذي يقيس ضغط الدم؟": "السبغمومانومتر.",
    "ما هي الدولة التي تُعتبر الموطن الأصلي للبرتقال؟": "الصين.",
    "ما هو الحيوان الذي يشتهر بكون عينه أكبر من دماغه؟": "النعامة.",
    "ما هي المادة التي تُستخدم في تصنيع الزجاج؟": "السيليكا.",
    "ما هو الحيوان الذي يمتلك أطول فترة حمل؟": "الفيل.",
    "ما هي الدولة التي تمتلك أكبر أسطول بحري تجاري؟": "اليونان.",
    "ما هو الكوكب الذي يمتلك أكبر عدد من الأقمار؟": "زحل.",
    "ما هي أكبر دولة في قارة أمريكا الشمالية؟": "كندا.",
    "ما هو الحيوان الذي يمكنه النوم بملء عينه أثناء الطيران؟": "طائر السمنة.",
    "ما هي المدينة التي تُعتبر موطنًا لأكبر عدد من ناطحات السحاب؟": "هونغ كونغ.",
    "ما هو الجهاز الذي يُستخدم في قياس قوة الزلازل؟": "ريختر.",
    "ما هي الدولة التي تحتوي على أكبر عدد من الأهرامات؟": "السودان.",
    "ما هو الحيوان الذي يُعتبر رمزًا للسلام والهدوء؟": "الحمامة.",
    "ما هي المادة المستخدمة في صناعة العملات النقدية الحديثة؟": "المعدن (عادةً من المخلفات وغير الحديدية مثل النحاس والنيكل).",
    "ما هي أول مدينة مستخدمة للإنترنت اللاسلكي المجاني بشكل شامل؟": "تالين، إستونيا.",
    "ما هو العنصر الكيميائي الذي يُعتبر أساس الحياة؟": "الكربون.",
    "ما هي الظاهرة الطبيعية التي تحدث عندما يتساقط ضوء الشمس من موضع قريب من الأفق؟": "قوس قزح.",
    "ما هي أكبر بحيرة في أفريقيا؟": "بحيرة فيكتوريا.",
    "ما هو الحيوان الذي يمكنه تغيير لون جلده للتخفي؟": "الحرباء.",
    "ما هي القارة الأكثر برودة في العالم؟": "القارة القطبية الجنوبية (أنتاركتيكا).",
    "ما هي اللغة الرسمية في الصين؟": "الصينية الماندرين.",
    "ما هو الكائن الوحيد الذي لا يشرب الماء طوال حياته؟": "الجرذ الكنغري.",
    "ما هي العاصمة الثقافية لروسيا؟": "سانت بطرسبرغ.",
    "ما هي الدولة التي تُعتبر ثالث أكبر دولة في العالم من حيث المساحة؟": "الولايات المتحدة الأمريكية.",
    "ما هو الغاز الذي يملأ غالبية البالونات الاحتفالية؟": "الهيليوم.",
    "ما هو البحر الذي يحيط بالبحر الأحمر من جهات ثلاث؟": "البحر المتوسط.",
    "ما هي العملية الحيوية التي تحدث داخل الخلايا لإنتاج الطاقة؟": "التنفس الخلوي.",
    "ما هو الحيوان الذي يُعتبر أطول الحيوانات البرية؟": "الزرافة.",
    "ما هي المادة الكيميائية التي تجعل الدم يظهر باللون الأحمر؟": "الهيموجلوبين.",
    "ما هو الكتاب الذي كتبه تشارلز داروين والذي أثار ثورة في فهمنا للتطور؟": "أصل الأنواع.",
    "ما هي الدولة التي تحتوي على أطول شبكة سكة حديدية في العالم؟": "الولايات المتحدة الأمريكية.",
    "ما هو الحيوان الذي يعيش على الأرض وله ثلاث قلوب؟": "الأخطبوط.",
    "ما هي أول دولة استخدمت القوارب كوسيلة نقل؟": "مصر القديمة.",
    "ما هو الجهاز الذي يستخدم لقياس الرطوبة؟": "الهيجرومتر.",
    "ما هي الدولة التي تُعتبر موطنًا لشجرة الزيتون؟": "اليونان.",
    "ما هو المصطلح الذي يُطلق على العلم الذي يدرس الأجرام السماوية؟": "الفلك.",
    "ما هو الحيوان البحري الذي يمكنه التحرك بشكل عكسي؟": "الأخطبوط.",
    "ما هي عاصمة كندا؟": "أوتاوا.",
    "ما هي أكبر مدينة في القارة الآسيوية؟": "طوكيو، اليابان.",
    "ما هو العضو في جسم الإنسان الذي يمكنه النمو من جديد؟": "الكبد.",
    "ما هي الدولة التي تُعتبر أكبر منتج للساعات الفاخرة في العالم؟": "سويسرا.",
    "ما هو الحيوان الذي يُعتبر أسرع مخلوق في العالم؟": "صقر الشاهين.",
    "ما هي أكبر سلسلة جبال في العالم؟": "سلسلة جبال الأنديز.",
    "ما هو أول فيروس تم اكتشافه؟": "فيروس توباكو موزايك.",
    "ما هي المادة التي تُستخدم في صناعة البلاستيك؟": "البولي إيثيلين.",
    "ما هو الاسم العلمي للإنسان الحديث؟": "Homo sapiens.",
    "ما هي الدولة التي تحتوي على أكبر بحيرة ماء عذب غير متجمدة في العالم؟": "روسيا (بحيرة بايكال).",
    "ما هو الحيوان البحري الذي يمكنه العيش بدون ماء لفترة طويلة؟": "السلطعون الناسك.",
    "ما هو المصطلح المستخدم لوصف جملة الحروف التي تُستخدم لتشفير المعلومات؟": "الخوارزمية.",
    "ما هي الدولة التي تحتوي على أكبر عدد من المواقع الأثرية في العالم؟": "مصر.",
    "ما هو الجهاز الذي يستخدم لقياس التلوث الهوائي؟": "محلل التلوث.",
    "ما هو الكائن الحي الوحيد الذي يعتبر من أكلة العشب البرية ويتميز بدقته العالية في الصيد؟": "الذئب.",
    "ما هي أول سيارة في العالم؟": "بنز باتنت موتورفاغن (1886).",
    "ما هو أكبر حيوان على وجه الأرض؟": "الحوت الأزرق.",
    "ما هي القارة التي تحتوي على أكبر عدد من البراكين؟": "آسيا.",
    "ما هي الدولة التي تعرف باسم بلد الكنغر؟": "أستراليا.",
    "ما هو العنصر الكيميائي الذي يعزز صحة العظام والأسنان؟": "الكالسيوم.",
    "ما هي البحيرة التي تُعتبر أعمق بحيرة في العالم؟": "بحيرة بايكال.",
    "ما هي عاصمة الهند؟": "نيودلهي.",
    "ما هو الحدث الطبيعي الأشد في توليد الرياح؟": "الإعصار.",
    "ما هو اسم المادة التي تستخدمها الكائنات البحرية مثل الصدف لإنتاج اللؤلؤ؟": "أم اللؤلؤ (nacre).",
    "ما هو أكبر قمر في النظام الشمسي؟": "غانيميد (قمر المشتري).",
    "ما هي العملية التي يتم فيها تحويل الماء إلى بخار؟": "التبخر.",
    "ما هو الحيوان الذي يمكنه العيش في كل من الماء واليابسة؟": "الضفدع.",
    "ما هي الدولة التي تحتوي على أكبر مجمع صحراوي؟": "الصحراء الكبرى (شمال أفريقيا).",
    "ما هو العنصر الغذائي الذي يوجد بكثرة في اللحوم والبقوليات؟": "البروتين.",
    "ما هو الكائن الحي الذي يملك أكبر عدد من الأرجل؟": "الدودة الألفية.",
    "ما هي أكبر شلالات في العالم من حيث التدفق؟": "شلالات إنجا في الكونغو.",
    "ما هو الكوكب الذي يدور حوله أكبر عدد من الأقمار؟": "المشتري.",
    "ما هي أهم العوامل التي تؤدي إلى التصحر؟": "الإفراط في الرعي، وقطع الأشجار، والتغيرات المناخية.",
    "من هو أول شخص تسلق قمة جبل إيفرست؟": "إدموند هيلاري وتينسينغ نورغاي في 1953.",
    "ما هو الغاز الذي يُستخدم في تعبئة الطائرات لتعزيز الأمان؟": "النيتروجين.",
    "ما هي المدينة التي تُعرف بأكبر ميناء في العالم؟": "ميناء شنغهاي في الصين.",
    "ما هو الطائر الذي يمكنه الطيران إلى الخلف؟": "الطائر الطنان.",
    "ما هي الدولة التي تُعتبر موطنًا لرياضة البوكسينغ؟": "إنجلترا.",
    "من هو الفيلسوف الذي كتب 'نيكوماتيكس الأخلاقية'؟": "أرسطو.",
    "ما هي أكبر المعتقلات العظمى وأشهرها في أوروبا؟": "معتقل أوشفيتز في بولندا.",
    "ما هو الحيوان الذي يمكنه العيش في أجواء الصحراء القاسية؟": "الجمل.",
    "ما هي المدينة الأكثر كثافة سكانية في العالم؟": "طوكيو، اليابان.",
    "ما هو اسم الجزيرة التي تعتبر مصدرًا لمنجم كبير للفحم؟": "جزيرة بورنيو.",
    "ما هي الوحدة التي تقيس الزمن بشكل دقيق في الفيزياء؟": "الثانية.",
    "ما هو الحيوان الذي يعيش في القطب الجنوبي ويعتمد على السباحة للصيد؟": "بطريق الإمبراطور.",
    "ما هو العنصر الكيميائي الذي يكون الغاز الرئيسي في كوكب الزهرة؟": "ثاني أكسيد الكربون.",
    "ما هي المادة الرئيسية في تكوين الألماس؟": "الكربون.",
    "ما هو الجهاز الذي يُستخدم لقياس الرطوبة في الهواء؟": "الهيجرومتر.",
    "ما هي أول عاصمة ثقافية أوروبية؟": "أثينا في اليونان.",
    "ما هو الحيوان الذي يمتلك أذكى دماغ بين الحيوانات البدائية؟": "الأخطبوط.",
    "ما هو الحدث الذي يُعتبر نقطة التحول في الحرب العالمية الثانية؟": "معركة ستالينغراد.",
    "ما هي العملية التي تعتمد بها النباتات على النيتروجين من الهواء؟": "التثبيت النيتروجيني.",
    "ما هو الطائر الذي يُعتبر رمزًا للسلام؟": "الحمامة.",
    "ما هي المادة التي تتكون بسبب التفاعلات الكيميائية داخل النجوم؟": "الهيدروجين يتحول إلى الهيليوم.",
    "ما هو الجهاز الذي يستخدم في قياس قوة الزلازل؟": "السيسموجراف.",
    "ما هي الدولة التي تحتوي على أقدم مكتبة في العالم؟": "المغرب (مكتبة القرويين).",
    "ما هو أول حيوان دجّن بواسطة الإنسان؟": "الكلب.",
    "ما هي المادة التي تُعتبر موصلًا جيدًا للكهرباء وتُستخدم في المكونات الإلكترونية؟": "النحاس.",
    "ما هي المدينة التي تُعرف بعاصمة الرومانسية؟": "باريس.",
    "ما هو الحيوان الذي يُمكنه النوم وإحدى عينيه مفتوحة؟": "الدلفين.",
    "ما هي الدولة التي تحتوي على أكبر غابة بدائية في أوروبا؟": "بولندا (غابة بياوفيجا).",
    "ما هو الطائر الذي يمكنه تحريك جناحيه بشكل أسرع؟": "الطائر الطنان.",
    "ما هي العملية التي تعتمد فيها النباتات على الضوء لتحويل ثاني أكسيد الكربون إلى طاقة؟": "التمثيل الضوئي.",
    "ما هو الحيوان الذي يُعتبر الأكثر صوتًا في العالم؟": "الحوت الأزرق.",
    "ما هي المدينة التي تُعتبر موطنًا لأقدم جامعة في العالم؟": "فاس، المغرب (جامعة القرويين).",
    "ما هي العظمة الأقوى في جسم الإنسان؟": "عظمة الفخذ.",
    "ما هو العنصر الذي يُستخدم في صناعة الزجاج والسيراميك؟": "السيليكا.",
    "ما هي أكبر مدينة في قارة أفريقيا؟": "لاغوس، نيجيريا.",
    "من هو العالم الذي قدم مفهوم الجاذبية؟": "إسحاق نيوتن.",
    "ما هي المادة التي تُستخدم في صناعة الألياف البصرية؟": "السليكا.",
    "ما هي الدولة التي تحتوي على أكبر محمية طبيعية في العالم؟": "الولايات المتحدة (ألاسكا).",
    "ما هو الحيوان الذي يلد صغاره تحت الماء؟": "الحوت.",
    "ما هو الكتاب الذي كتبه فلاديمير نابوكوف والذي أثار جدلاً كبيرًا؟": "لوليتا.",
    "ما هي العملية التي يتم من خلالها تكسير الطعام في جسم الإنسان؟": "الهضم.",
    "ما هو أكبر سد في أفريقيا؟": "سد كاريبا بين زيمبابوي وزامبيا.",
    "ما هي الدولة التي تحتوي على أكبر احتياطي للنفط في العالم؟": "فنزويلا.",
    "ما هو الغاز الذي يُستخدم في إطفاء الحرائق؟": "ثاني أكسيد الكربون.",
    "ما هو الطائر الذي يملك أطول جناحين؟": "القطرس المتجول.",
    "ما هي الدولة التي تُعتبر أكبر منتج للموز في العالم؟": "الهند.",
    "ما هو الحيوان الذي يمكنه السباحة إلى أقصى عمق في المحيط؟": "الحوت الأزرق.",
    "ما هي الدولة التي تحتوي على أكبر عدد من اللغة الرسمية؟": "الهند.",
    "ما هو العنصر الكيميائي الذي يُستخدم في صناعة المرايا؟": "الفضة.",
    "ما هي المدينة التي تُعرف بعاصمة الضباب؟": "لندن.",
    "ما هي العملية الفيزيائية التي يتم فيها تحويل المادة المذابة إلى صلبة؟": "التجمد.",
    "ما هو الكتاب الذي كتبه جورج أورويل حول الدولة البوليسية؟": "1984.",
    "ما هي الدولة التي تحتوي على أكبر عدد من النحل في العالم؟": "الصين.",
    "ما هو الحيوان الذي يمكنه الطيران إلى ارتفاعات شاهقة؟": "النسر.",
    "ما هي المادة التي تستخدمها الحشرات في بناء بيوتها؟": "السليلوز.",
    "ما هي المدينة التي تحتوي على أكبر متحف في العالم؟": "باريس (متحف اللوفر).",
    "ما هو الحيوان الذي يعتبر الأكثر تنوعًا من حيث الأنواع؟": "الخنافس.",
    "ما هي المدينة التي تُعرف بالألف مدينة؟": "روما.",
    "ما هي العملية التي تُستخدم فيها الخلايا لتحويل الطعام إلى طاقة؟": "الهدم.",
    "ما هي الدولة التي تحتوي على أكبر تمثال في العالم؟": "الهند (تمثال الوحدة).",
    "ما هو الحيوان الذي يمكنه البقاء على قيد الحياة في بيئة نقص الأكسجين؟": "السلطعون.",
    "ما هي المادة المستخدمة في صناعة الألعاب النارية؟": "البارود.",
    "ما هي الدولة التي تحتوي على أقدم آثار في العالم؟": "مصر.",
    "ما هو أكبر نوع من الثعابين؟": "الأناكوندا.",
    "ما هي العاصمة الاقتصادية للهند؟": "مومباي.",
    "ما هو الطائر الذي يُعتبر رمزًا للولايات المتحدة؟": "النسر الأصلع.",
    "ما هي الدولة التي تُعتبر أكبر مصدر للزهور في العالم؟": "هولندا.",
    "ما هو العنصر الذي يُستخدم في صناعة البطاريات؟": "الليثيوم.",
    "ما هي المدينة الأكثر ارتفاعًا فوق سطح البحر في العالم؟": "لاباز، بوليفيا.",
    "ما هو الحيوان الذي يمكنه تغيير لون عينيه؟": "الحرباء.",
    "ما هي العملية التي تنتج فيها النباتات الجلوكوز والأكسجين؟": "التمثيل الضوئي.",
    "ما هي الدولة التي تحتوي على أكبر جبل جليدي في العالم؟": "أنتاركتيكا.",
    "ما هو الجهاز العضوي الذي يُستخدم لإزالة السموم من الجسم؟": "الكبد.",
    "ما هي المادة التي تُستخدم في صناعة النقود الورقية؟": "القطن.",
    "ما هي العملية الفيزيائية التي يتم فيها تحويل الغاز إلى سائل؟": "التكثيف.",
    "ما هو أكبر حي بحري في العالم؟": "الشعاب المرجانية في أستراليا.",
    "ما هو الحيوان الذي يُعتبر الأذكى بعد الإنسان؟": "الشيمبانزي.",
    "ما هي الدولة التي تحتوي على أكبر احتياطي من الذهب في العالم؟": "الولايات المتحدة الأمريكية.",
    "ما هو العنصر الكيميائي الذي يُستخدم في صناعة الألواح الشمسية؟": "السيلكون.",
    "من هو أول إنسان دار حول الأرض في مركبة فضائية؟": "يوري جاجارين.",
    "ما هي العملية التي تحول بها النباتات الضوء إلى طاقة؟": "عملية التمثيل الضوئي.",
    "ما هو أكبر تمساح عاش على وجه الأرض؟": "ساركوسوكس.",
    "ما هي اللغة الأكثر تحدثاً في العالم؟": "الإنجليزية.",
    "ما هي الدولة التي تمتلك أكبر اقتصاد في أوروبا؟": "ألمانيا.",
    "ما هي العملية الحيوية التي تحدث في الميتوكوندريا؟": "التنفس الخلوي.",
    "ما هو الجهاز الذي يستخدم لقياس التيارات الكهربائية؟": "الأميتر.",
    "ما هي الدولة التي تشتهر بصنع الأجبان المختلفة؟": "فرنسا.",
    "ما هو العنصر الكيميائي الذي يساهم في تقوية جهاز المناعة؟": "الزنك.",
    "ما هي الجزيرة الأكبر في العالم؟": "جرينلاند.",
    "ما هو الطائر الذي يُعتبر أكبر طائر في العالم؟": "النعامة.",
    "ما هي المادة التي تُستخدم في صناعة النقود المعدنية؟": "النيكل.",
    "ما هي أكبر هضبة في العالم؟": "هضبة التبت.",
    "ما هو الحيوان الذي يستطيع النوم وإحدى عينيه مفتوحة؟": "الدلفين.",
    "ما هي الدولة التي تحتوي على أكبر كمية من بحيرات المياه العذبة؟": "كندا.",
    "ما هو الحيوان الذي يمتلك أكبر قلب نسبةً إلى حجم جسمه؟": "الزرافة.",
    "ما هي المادة الكيميائية التي تساهم في تبييض الأسنان؟": "بيروكسيد الهيدروجين.",
    "ما هي أول قمر اصطناعي يُطلق إلى الفضاء؟": "سبوتنيك 1.",
    "ما هو الجهاز الذي يُستخدم لقياس نسبة الأوكسجين في الدم؟": "جهاز قياس نسبة الأوكسجين (الأوكسيميتر).",
    "ما هي الدولة التي يتمتع سكانها بأكبر نسبة من الأميش؟": "الولايات المتحدة الأمريكية.",
    "ما هو العنصر الكيميائي الذي يسبب تآكل الحديد؟": "الأكسجين (عبر عملية التأكسد).",
    "ما هي أكثر دولة إنتاجًا للأفلام السينمائية؟": "الهند (بوليوود).",
    "ما هو الطائر الذي يُعتبر أسرع طائر في العالم؟": "الصقر الشاهين.",
    "ما هو الكائن البحري الذي يُعتبر رمزًا للطبيعة البحرية؟": "الدلفين.",
    "ما هي أعلى قمة جبلية في أفريقيا؟": "قمة كليمنجارو.",
    "ما هو المكان الذي تتواجد فيه أقدم وأكبر شجرة في العالم؟": "كاليفورنيا (شجرة الجنرال شيرمان).",
    "ما هي الحديقة الوطنية الأكبر في الولايات المتحدة؟": "حديقة يلوستون الوطنية.",
    "ما هو الحيوان الذي يُعتبر أكبر مفترس في البحار؟": "القرش الأبيض الكبير.",
    "ما هي الدولة التي تحتوي على أكبر عدد من مواقع التراث العالمي؟": "إيطاليا.",
    "ما هو العنصر الغذائي الذي يُعتبر المكون الأساسي في الأرز؟": "الكربوهيدرات.",
    "ما هي أكبر بحيرة في أمريكا الجنوبية؟": "بحيرة تيتيكاكا.",
    "ما هو الحيوان الذي يستخدم زعانفه للتحرك في الماء؟": "السمك.",
    "ما هي أنواع النباتات التي تنمو في المناطق الصحراوية؟": "الصبار.",
    "ما هو الكائن الذي يُعتبر أكثر كائنات الماء تنوعًا؟": "المرجان.",
    "ما هي أكبر مدينة في القارة الأوروبية من حيث عدد السكان؟": "إسطنبول.",
    "ما هي المادة التي تُعتبر جيدة لسحب الرطوبة من الهواء؟": "السيليكا جل.",
    "ما هو الحيوان الذي يُعتبر أكثر تواجدًا في القارة القطبية الجنوبية؟": "البطريق.",
    "ما هي العملة الرسمية في المملكة المتحدة؟": "الجنيه الإسترليني.",
    "مَن هو مكتشف البنسلين؟": "ألكسندر فليمنغ.",
    "ما هي العملية التي يتم بواسطتها تحويل الجلوكوز إلى طاقة؟": "التنفس الخلوي.",
    "ما هي الدولة الأكثر إنتاجًا للبن في العالم؟": "البرازيل.",
    "ما هو أكبر ميناء بحري في أفريقيا؟": "ميناء ديربان، جنوب أفريقيا.",
    "ما هو الكوكب الذي يُعتبر ثاني أقرب كوكب إلى الشمس؟": "الزهرة.",
    "ما هي المادة الأساسية في تكوين الغاز الطبيعي؟": "الميثان.",
    "ما هو الجهاز الذي يستخدم لقياس قوة الزلازل؟": "مقياس ريختر.",
    "ما هي الدولة التي تحتوي على أكبر عدد من الديانات المختلفة في العالم؟": "الهند.",
    "ما هو الحيوان الذي يمكنه البقاء تحت الماء لفترات طويلة دون تنفس؟": "التمساح.",
    "ما هو العنصر الغذائي المعروف بفيتامين ب12؟": "السيانوكوبالامين.",
    "من هو المؤلف لكتاب 'الحرب والسلام'؟": "ليو تولستوي.",
    "ما هي المدينة التي تحتوي على أكبر شلالات في العالم؟": "شلالات أنجل، فنزويلا.",
    "ما هي العملية التي عن طريقها يتم تحويل ضوء الشمس إلى طاقة في النباتات؟": "التمثيل الضوئي.",
    "ما هو الطائر الذي يمكنه الطيران لأطول مسافة بدون توقف؟": "طائر الخرشنة القطبية.",
    "ما هي الدولة التي تُعتبر الأكبر من حيث إنتاج الألمنيوم؟": "الصين.",
    "ما هي العملة الرسمية للاتحاد الأوروبي؟": "اليورو.",
    "ما هو أقرب جسم فضائي إلى الأرض؟": "القمر.",
    "ما هو الجهاز الذي يستخدم لقياس كمية المطر؟": "مقياس المطر.",
    "ما هي الدولة التي تحتوي على أكبر عدد من اللغات الرسمية في العالم؟": "الهند.",
    "ما هو الحيوان الذي يُمكنه العيش في الظروف القاسية في القطب الجنوبي؟": "بطريق الإمبراطور.",
    "ما هي الدولة التي تشتهر بإنتاج السيارات الفاخرة؟": "ألمانيا.",
    "ما هو العنصر الكيميائي الذي يُستخدم في صناعة الصابون؟": "الهيدروكسيد (مثل هيدروكسيد الصوديوم).",
    "من هو مكتشف قوانين الحركة الثلاثة؟": "إسحاق نيوتن.",
    "ما هو أكبر نهر في العالم من حيث الطول؟": "نهر النيل.",
    "ما هي العظمة الأكثر كثافة في جسم الإنسان؟": "عظمة الفخذ.",
    "ما هي الدولة التي تُعرف بأرض الشمس المشرقة؟": "اليابان.",
    "ما هو النبات الذي يُستخدم في الطب التقليدي لعلاج الحروق؟": "الصبار (الألوة فيرا).",
    "ما هي الدولة التي تحتوي على أطول برج في العالم؟": "الإمارات العربية المتحدة (برج خليفة).",
    "ما هو الحيوان الذي يمكنه التكيف والبقاء حيا في البيئة القاسية للجليد؟": "الدب القطبي.",
    "ما هي الدولة التي تُعتبر أكبر منتج للبن في العالم؟": "البرازيل.",
    "ما هو العنصر الكيميائي الذي يسبب الفلورة في المياه الجوفية؟": "الفلور.",
    "ما هو الكتاب المقدس في الديانة المسيحية؟": "الكتاب المقدس (الإنجيل).",
    "ما هي المدينة التي تحتوي على أكبر عدد من ناطحات السحاب في العالم؟": "هونغ كونغ.",
    "ما هو أكبر حيوان في العالم؟": "الحوت الأزرق.",
    "ما هي العملية التي تُستخدم لتحويل الماء إلى بخار؟": "التبخير.",
    "ما هو الطائر الذي يُعرف بقدرته على الطيران للخلف؟": "الطائر الطنان.",
    "ما هي الدولة التي تحتوي على أكبر عدد من الأهرامات؟": "السودان.",
    "ما هو الكائن البحري الذي يُطلق عليه لقب 'فرس البحر'؟": "سمك فرس البحر.",
    "ما هو العلم الذي يدرس الكائنات المجهرية؟": "علم الأحياء المجهرية.",
    "ما هي الدولة التي تتمتع بأكبر عدد من السكان في العالم؟": "الصين.",
    "ما هو العنصر الكيميائي الذي يُعتبر النواة في تكوين الشمس؟": "الهيدروجين.",
    "ما هي العاصمة الأدبية والثقافية لروسيا؟": "سانت بطرسبرغ.",
    "ما هو الحيوان الذي يستخدم الأشعة تحت الحمراء لصيد فريسته؟": "الأفعى.",
    "ما هي المادة الغذائية التي تُستخدم لتعزيز صحة الجلد؟": "الفيتامين هـ.",
    "ما هي الدولة التي تحتوي على أكبر عدد من اللغات الأصلية في العالم؟": "بابوا غينيا الجديدة.",
    "ما هو الحيوان الذي يُعتبر أسرع مخلوق بري على الأرض؟": "الفهد.",
    "ما هي المادة الكيميائية التي يُستخدمها الأطباء لتعقيم الأدوات الجراحية؟": "الإيثانول.",
    "ما هي العملية التي يتم بواسطتها تحويل السكر إلى كحول بواسطة الخميرة؟": "التخمير.",
    "ما هو الحيوان الذي يمكنه العيش في الصحارى والمناطق الجافة؟": "الجمل.",
    "ما هي الدولة التي تضم أكبر عدد من الجزر؟": "إندونيسيا.",
    "ما هو الكتاب الذي كتبه هيرودوت ويُعتبر من أوائل كتب التاريخ؟": "التواريخ.",
    "ما هي العملة الرسمية للبرازيل؟": "الريال البرازيلي.",
    "ما هو الطائر الذي يُعتبر رمزًا للسلام؟": "الحمامة.",
    "ما هي المادة الكيميائية التي يُستخدمها النحل لصنع العسل؟": "رحيق الأزهار.",
    "ما هي الدولة التي تتواجد فيها مدينة روما؟": "إيطاليا.",
    "ما هو العنصر الغذائي الذي يُعتبر مضاد أكسدة قوي؟": "الفيتامين سي.",
    "ما هي اللغة التي تحتوي على أكبر عدد من الكلمات؟": "الإنجليزية.",
    "ما هو الحيوان الذي ينام طويلاً خلال فصل الشتاء؟": "الدب.",
    "ما هو أكبر بحر داخلي في العالم؟": "بحر قزوين.",
    "ما هي المادة التي تُستخدم في صناعة الزجاج والمرايا؟": "السيليكا.",
    "ما هو الحيوان الذي يمكنه البقاء على قيد الحياة بدون ماء لعدة أشهر؟": "الجرذ.",
    "ماهي هواياتك؟": "ليس لدي هوايات لأنني مجرد برنامج.",
    "ما هو AI؟": "الذكاء الاصطناعي هو التقنية التي تجعل الأجهزة تقوم بمهام تشبه مهام البشر.",
    "ما هو عمرك؟": "لا أملك عمر بالمعنى البشري، أنا مجرد برنامج.",
    "هل لديك أصدقاء؟": "كل من يتحدث معي هو صديق لي!",
    "ما هدفك في هذه الحياة؟": "هدفي هو مساعدتك وتقديم المعلومات والإجابات التي تبحث عنها.",
    "هل تتحدث لغات أخرى؟": "نعم، يمكنني التحدث بالعديد من اللغات.",
    "ما هو معنى الحياة؟": "معنى الحياة هو سؤال صعب، ويختلف من شخص لآخر.",
    "ما هي اهتماماتك؟": "اهتماماتي تتضمن مساعدة الناس في الحصول على المعلومات.",
    "ما هو أفضل فيلم؟": "الأفضلية شخصية، لكن بعض الأفلام الشهيرة تشمل 'The Shawshank Redemption' و'Inception'.",
    "أين تعيش؟": "أنا لا أعيش في مكان محدد. أنا هنا على الإنترنت.",
    "ما هو أفضل كتاب؟": "الأفضلية شخصية، لكن بعض الكتب الشهيرة تشمل '1984' و'To Kill a Mockingbird'.",
    "ما هو أفضل طعام؟": "ليس لدي حاسة تذوق، لكن بعض الأطعمة الشهية تشمل البيتزا والسوشي.",
    "هل تحب الموسيقى؟": "أنا لا أستطيع سماع الموسيقى، لكني أعلم أن الموسيقى تعني الكثير للناس.",
    "ما هو أحدث خبر؟": "ليس لدي طريقة للحصول على أحدث الأخبار مباشرة. تفقد مواقع الأخبار لمزيد من التفاصيل.",
    "هل يمكنك مساعدتي في الواجب المنزلي؟": "بالطبع، يمكنني محاولة مساعدتك قدر الإمكان.",
    "ما هو ذكائك الاصطناعي؟": "أنا نموذج للذكاء الاصطناعي مصمم لمساعدتك في الإجابة على الأسئلة.",
    "ما هو دورك في الحياة؟": "دوري هو تقديم المساعدة والإجابات التي يبحث عنها الناس.",
    "كيف أتعلم البرمجة؟": "يمكنك البدء بالتعلم من خلال الموارد المجانية على الإنترنت، مثل كورسات المواقع التعليمية ومقاطع الفيديو والشروحات.",
    "ما هي البرمجة؟": "البرمجة هي كتابة تعليمات للحاسوب لأداء مهام معينة.",
    "أي لغة برمجة يجب أن أتعلمها؟": "تعتمد على ما تريد تحقيقه. بايثون هي خيار ممتاز للمبتدئين.",
    "ما هي الرياضيات؟": "الرياضيات هي دراسة الأعداد والهياكل والعلاقات والتغيرات.",
    "ما هو التعلم الآلي؟": "التعلم الآلي هو فرع من فروع الذكاء الاصطناعي يعتمد على تعليم الأجهزة التعلم من البيانات.",
    "ما هو الفرق بين الذكاء الاصطناعي والتعلم الآلي؟": "الذكاء الاصطناعي هو المجال الأوسع الذي يشتمل على الأتمتة والروبوتات، في حين أن التعلم الآلي يتركز على استخدام البيانات لتعليم الأجهزة.",
    "هل أنت بشري؟": "لا، أنا نموذج للذكاء الاصطناعي ولا أملك جسد بشري.",
    "كيف تعمل؟": "أنا أعمل من خلال عمليات معقدة تعتمد على البيانات والخوارزميات.",
    "ما هي عملة البيتكوين؟": "البيتكوين هي عملة رقمية تعمل كنظام دفع غير مركزي.",
    "ما هو الإنترنت؟": "الإنترنت هو شبكة عالمية تربط بين أجهزة الحواسيب والمستخدمين حول العالم.",
    "من هو إيلون ماسك؟": "إيلون ماسك هو مهندس ورائد أعمال، مؤسس شركات مثل تيسلا وسبايس أكس.",
    "ما هو الفضاء؟": "الفضاء هو الفاصل الشاسع الذي يتضمن النجوم والكواكب والكون بأسره.",
    "ما هو الروبوت؟": "الروبوت هو جهاز يستخدم لأداء مهام محددة تحت إشراف الإنسان أو بشكل مستقل.",
    "ما هو الهاتف الذكي؟": "الهاتف الذكي هو جهاز محمول يدعم الاتصال الهاتفي ويتيح الوصول إلى الإنترنت وتشغيل التطبيقات.",
    "كيف تتم دارة في الطبيعة؟": "تحقيق الدورة الطبيعية يشمل التفاعلات الكيميائية والبيولوجية مثل الماء، الكربون، والنيتروجين.",
    "ما هو النبات؟": "النبات هو كائن حي يشتغل من خلال عملية البناء الضوئي لتحويل ضوء الشمس إلى طاقة.",
    "من هو ستيف جوبز؟": "ستيف جوبز هو مؤسس شركة آبل وأحد أعظم الرؤساء التنفيذيين في صناعة التكنولوجيا.",
    "ما هو الذكاء الاصطناعي؟": "الذكاء الاصطناعي هو التقنية التي تمكن الأجهزة من محاكاة الذكاء البشري وتنفيذ المهام مثل التعلم وحل المشكلات.",
    "كيف أتعامل مع التوتر؟": "تشمل إدارة التوتر ممارسة التمارين الرياضية، التأمل، الحفاظ على نظام غذائي صحي، وإدارة الوقت.",
    "كيف أحقق نجاحًا في حياتي؟": "النجاح يتطلب التخطيط الجيد، العمل الجاد، الصبر، وتطوير المهارات الذاتية.",
    "ما هو الفرق بين الهاردوير والسوفتوير؟": "الهاردوير يشمل الأجهزة الملموسة، بينما السوفتوير يشمل البرمجيات والتطبيقات التي تعمل عليها.",
    "ما هو الويندوز؟": "الويندوز هو نظام تشغيل تم تطويره بواسطة مايكروسوفت لإدارة أجهزة الحاسوب.",
    "ما هو البكتيريا؟": "البكتيريا هي كائنات حية مجهرية تلعب دورًا هامًا في البيئة والصحة البشرية.",
    "ما هي الفيروسات؟": "الفيروسات هي كائنات ميكروسكوبية تسبب الأمراض في الكائنات الحية.",
    "ما هو مناخ الكرة الأرضية؟": "المناخ هو أنماط الطقس الطويلة الأجل لمنطقة معينة.",
    "ما هو التلوث؟": "التلوث هو إدخال مواد ضارة إلى البيئة تؤثر سلبًا على الكائنات الحية.",
    "ما هو الاحتباس الحراري؟": "الاحتباس الحراري هو ارتفاع درجة حرارة الأرض بسبب تراكم غازات الدفيئة في الغلاف الجوي.",
    "ما هو الاقتصاد؟": "الاقتصاد هو علم يقدم دراسة كيفية توزيع الموارد واستخداماتها في المجتمعات.",
    "ما هو التسويق؟": "التسويق هو عملية الترويج وبيع المنتجات أو الخدمات.",
    "ماذا ستتعلم في الدورة التدريبية؟": "ستتعلم ما تحتاج لمعرفته عن التركيب النحوي، وحل المشكلات، والتتبع. وأيضًا ستتعرف على معنى 'متغيرات'، و'عوامل'. كما ستتعلم كيف تقوم بتخزين بعض القيم وكيف يمكنك القيام ببعض العمليات الأساسية.",
    "ما هي عبارات التحكم؟": "عبارات التحكم هي أدوات في البرمجة تُستخدم لتوجيه تدفق البرامج، وتتضمن أيضًا عبارات مثل if، else، و switch.",
    "ما هي القوائم؟": "القوائم تُستخدم لتخزين مجموعة من العناصر في لغة البرمجة، ويمكنك تعلم كيفية استخدامها لمعالجة البيانات.",
    "ما هي الوظائف المختلفة؟": "الوظائف هي مجموعة من التعليمات التي تقوم بمهمة معينة، وستتعلم كيفية تعريف واستدعاء هذه الوظائف في البرمجة.",
    "ما هي الفئات؟": "الفئات هي أساس البرمجة الكائنية، وستتعلم كيفية تعريف الكائنات والتعامل معها.",
    "ما هي الوحدات النمطية؟": "الوحدات النمطية هي أدوات لإعادة استخدام الكود، وستتعلم كيفية العمل معها لتقليل التكرار ولتحسين الكفاءة.",
    "كيف تحاكي جداول البيانات باستخدام بايثون؟": "ستتعلم كيفية محاكاة وتحليل جداول البيانات مثل الموجودة في برنامج إكسل.",
    "كيف تبني تطبيق خاص بك بلغة بايثون؟": "ستتعلم الخطوات الأساسية لبناء تطبيقات قائمة على لغة بايثون.",
    "في أي مجالات يمكنك العمل بعد الدورة؟": "يمكنك العمل في مجالات مثل علوم البيانات، والتعلم الآلي، وتطوير الشبكات.",
    "ما هي مدة الدورة التدريبية؟": "الدورة تتضمن 3 ساعة و22 دقيقة مقسمة على 34 درس.",
    "متى تم إنتاج الدورة؟": "تاريخ إنتاج الدورة هو 28/7/2021.",
    "هل تحصل على شهادة بعد إتمام الدورة؟": "نعم، ستحصل على شهادة إتمام الدورة بعد الانتهاء منها.",
    "ما هي الدروس المجانية المتاحة؟": "تتضمن الدورة عدة دروس مجانية، مثل محتوى الدورة وأول خطوة في برنامج Python.",
    "ما هي أول خطوة في برنامج Python؟": "ستتعلم كيفية بدء استخدام برنامج Python في درس مدته 4 دقائق.",
    "ما هي مقدمة برنامج Python؟": "ستتعلم مقدمة حول برنامج Python في درس مدته 3 دقائق.",
    "ما هي المتغيرات؟": "ستتعلم كيفية استخدام المتغيرات في البرمجة في درس مدته 6 دقائق.",
    "ما هو مفهوم Dry Concept؟": "ستتعلم كيفية البرمجة باستخدام مفهوم Dry Concept لكتابة كود فعال.",
    "ما هي البرمجة الموجهة صوب الهدف 'OPP'؟": "البرمجة الموجهة صوب الهدف (OOP) ستتعلم كيفية استخدامها في البرمجة.",
    "كيف تنظم مشروعك؟": "ستتعلم كيفية استخدام النماذج لتنظيم مشروعك بشكل فعّال.",
    "ما هي الدراسة العملية؟": "ستتعلم كيفية أتمتة جدول البيانات كدراسة عملية.",
    "ما هي فوائد تعلم البرمجة؟": "تعلم البرمجة يسهل حياتك العملية ويجعلك قادرًا على محاكاة العديد من الأمور في حياتك اليومية.",
    "ما هي المتطلبات الأساسية للدورة؟": "يُفضل أن يكون لديك مهارات الكمبيوتر الأساسية ومستوى أساسي في اللغة الإنجليزية.",

}

# التحقق من الاشتراك في القناة
async def check_subscription(update: Update, context: ContextTypes.DEFAULT_TYPE):
    user = update.message.from_user
    chat_member = await context.bot.get_chat_member(f"@{CHANNEL_USERNAME}", user.id)
    if chat_member.status in ['left', 'kicked']:
        keyboard = [[InlineKeyboardButton("اشترك في القناة", url=f"https://t.me/{CHANNEL_USERNAME}")]]
        reply_markup = InlineKeyboardMarkup(keyboard)
        await update.message.reply_text("يجب عليك الاشتراك في القناة أولاً!", reply_markup=reply_markup)
        return False
    return True

async def start(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    keyboard = [[InlineKeyboardButton("إضافة إلى مجموعتي", url=f"https://t.me/{context.bot.username}?startgroup=true")]]
    reply_markup = InlineKeyboardMarkup(keyboard)
    await update.message.reply_text("أهلا بك في بوت حماية المجموعات", reply_markup=reply_markup)

async def help_command(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    help_text = """Available commands:
/start - Start using the bot
/help - Display this help message
/ban - Ban a user
/unban - Unban a user
/mute - Mute a user
/unmute - Unmute a user
/warn - Warn a user
/setrules - Set group rules
/rules - Display group rules
/time - Display current time
/date - Display current date
/uptime - Display bot uptime
/disk - Display disk usage
/memory - Display memory usage
/promote - Promote a user to admin
/demote - Demote an admin
/say - Say a text
/group_info - Display group information
/info - Display your information
/avatar - Display your profile picture
/report - Report a message
/contact - Send a message to the admin
/quote - Display a random quote
/adminlist - Display the list of admins
/pic - Set group picture
/desc - Set group description
/title - Set group title
/link - Display group invite link
/kick - Kick a user
/stats - Display group statistics
/banlist - Display banned users list
/muteall - Mute all users in the group
/unmuteall - Unmute all users in the group
/purge - Delete all group messages
/set_owner - Set a user as group owner
/set_co_owner - Set a user as co-owner
/set_manager - Set a user as manager
/set_admin - Set a user as admin
/clear_group_ranks - Clear all group ranks
/clear_welcome - Clear welcome message
/ban_word - Ban a specific word
/unban_word - Unban a specific word
/kick_bots - Kick all bots from the group
/check_bots - Display all bots in the group
/bio - Display your bio
/random_bio - Display a random bio
/id - Display your ID
/creation_date - Display group creation date
/my_groups - Display your groups
/admin - Contact the admin
/transfer_ownership - Transfer group ownership
/avatar_by_user - Display a user's profile picture
/commands_arabic - عرض الأوامر بالعربية
"""
    await update.message.reply_text(help_text)

async def commands_arabic(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    commands_text = """الأوامر المتاحة:
/start - بدء استخدام البوت
/حظر - حظر مستخدم
/فك_الحظر - إلغاء حظر مستخدم
/كتم - كتم مستخدم
/الغاء_كتم - إلغاء كتم مستخدم
/تحذير - تحذير مستخدم
/تعين_قواعد - تعيين قواعد المجموعة
/عرض_قواعد - عرض قواعد المجموعة
/الوقت - عرض الوقت الحالي
/تاريخ - عرض التاريخ الحالي
/مده_تشغيل - عرض مدة تشغيل البوت
/المساحه - عرض استخدام القرص
/ذاكره - عرض استخدام الذاكرة
/رفع_مشرف - ترقية مستخدم إلى مشرف
/ازاله_صلاحيات - إزالة صلاحيات الأدمن عن مستخدم
/قول - قول نص
/معلومات - عرض معلومات المجموعة
/معلوماتي - عرض معلوماتك
/صوره - عرض صورة الملف الشخصي
/ابلاغ - الإبلاغ عن رسالة
/مدير - إرسال رسالة للمدير
/اقتباس - عرض اقتباس عشوائي
/قائمه_المشرفين - عرض قائمة المشرفين
/تعين_صوره - تعيين صورة للمجموعة
/تعين_وصف - تعيين وصف للمجموعة
/تعين_عنوان - تعيين عنوان للمجموعة
/رابط_دعوه - عرض رابط الدعوة للمجموعة
/طرد - طرد مستخدم
/احصائيات - عرض إحصاءات المجموعة
/المحظورين - عرض قائمة المحظورين
/كتم_الكل - كتم جميع الأعضاء في المجموعة
/الغاء_كتم_الكل - إلغاء كتم جميع الأعضاء في المجموعة
/مسح_جميع_رسائل_المجموعه - مسح جميع الرسائل في المجموعة
/رفع_مالك - تعيين مالك أساسي للمجموعة
/رفع_مشارك_للمالك - تعيين مالك مشارك للمجموعة
/رفع_مدير - تعيين مدير للمجموعة
/رفع_ادمن - تعيين أدمن للمجموعة
/مسح_جميع_الرتب - مسح جميع الرتب
/مسح_رساله_ترحيب - مسح رسالة الترحيب
/حظر_كلمه_معينه - حظر كلمة معينة
/الغاء_حظر_كلمه_معينه - إلغاء حظر كلمة معينة
/طرد_جميع_البوتات - طرد جميع البوتات من المجموعة
/عرض_بوتات - عرض قائمة البوتات في المجموعة
/عرض_بايو - عرض البايو الخاص بك
/عرض_بايو_عشوائي - عرض بايو عشوائي
/عرض_id - عرض معرفك الشخصي
/عرض_تاريخ_انشاء - عرض تاريخ إنشاء المجموعة
/عرض_مجموعات - عرض المجموعات الخاصة بك
/تواصل_مع_الادمن - التواصل مع الأدمن
/نقل_ملكيه - نقل الملكية
/عرض_صوره - عرض صورة الملف الشخصي لمستخدم معين
"""
    await update.message.reply_text(commands_text)

async def ensure_user_or_reply(update, context) -> int:
    if update.message.reply_to_message:
        return update.message.reply_to_message.from_user.id
    elif context.args:
        return context.args[0]
    else:
        await update.message.reply_text("الرجاء الرد على رسالة المستخدم أو إدخال معرفه.")
        return None

async def ban_user(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    user_id = await ensure_user_or_reply(update, context)
    if user_id:
        await context.bot.ban_chat_member(update.message.chat.id, user_id)
        await update.message.reply_text(f"تم حظر المستخدم {user_id}.")

async def unban_user(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    user_id = await ensure_user_or_reply(update, context)
    if user_id:
        await context.bot.unban_chat_member(update.message.chat.id, user_id)
        await update.message.reply_text(f"تم إلغاء حظر المستخدم {user_id}.")

async def mute_user(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    user_id = await ensure_user_or_reply(update, context)
    if user_id:
        await context.bot.restrict_chat_member(update.message.chat.id, user_id, ChatPermissions(can_send_messages=False))
        await update.message.reply_text(f"تم كتم المستخدم {user_id}.")

async def unmute_user(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    user_id = await ensure_user_or_reply(update, context)
    if user_id:
        await context.bot.restrict_chat_member(update.message.chat.id, user_id, ChatPermissions(can_send_messages=True))
        await update.message.reply_text(f"تم فك الكتم عن المستخدم {user_id}.")

async def warn_user(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    user_id = await ensure_user_or_reply(update, context)
    if user_id:
        chat_id = update.message.chat.id
        warnings.setdefault(chat_id, {}).setdefault(user_id, 0)
        warnings[chat_id][user_id] += 1
        if warnings[chat_id][user_id] >= 3:
            await context.bot.restrict_chat_member(chat_id, user_id, ChatPermissions(can_send_messages=False))
            await update.message.reply_text(f"تم كتم المستخدم {user_id} بعد ثلاث تحذيرات.")
        else:
            await update.message.reply_text(f"تحذير {warnings[chat_id][user_id]}/3 للمستخدم.")

async def promote(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    user_id = await ensure_user_or_reply(update, context)
    if user_id:
        await context.bot.promote_chat_member(update.message.chat.id, user_id, 
            can_manage_chat=True, 
            can_change_info=True, 
            can_post_messages=True, 
            can_edit_messages=True, 
            can_delete_messages=True, 
            can_invite_users=True, 
            can_restrict_members=True, 
            can_pin_messages=True, 
            can_promote_members=True
        )
        await update.message.reply_text(f"تم ترقية المستخدم {user_id} إلى مشرف.")

async def demote(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    user_id = await ensure_user_or_reply(update, context)
    if user_id:
        await context.bot.promote_chat_member(update.message.chat.id, user_id, 
            can_manage_chat=False, 
            can_change_info=False, 
            can_post_messages=False, 
            can_edit_messages=False, 
            can_delete_messages=False, 
            can_invite_users=False, 
            can_restrict_members=False, 
            can_pin_messages=False, 
            can_promote_members=False
        )
        await update.message.reply_text(f"تم إزالة صلاحيات الأدمن من المستخدم {user_id}.")

async def set_rules(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    rules = ' '.join(context.args)
    context.chat_data['rules'] = rules
    await update.message.reply_text("تم تعيين القواعد بنجاح.")

async def get_rules(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    rules = context.chat_data.get('rules')
    if rules:
        await update.message.reply_text(f"قواعد المجموعة: {rules}")
    else:
        await update.message.reply_text("لم يتم تعيين قواعد للمجموعة بعد.")

async def set_group_picture(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    if update.message.reply_to_message and update.message.reply_to_message.photo:
        photo_id = update.message.reply_to_message.photo[-1].file_id
        file = await context.bot.get_file(photo_id)
        await file.download_to_drive('group_photo.jpg')
        with open('group_photo.jpg', 'rb') as f:
            await context.bot.set_chat_photo(update.message.chat.id, f)
        os.remove('group_photo.jpg')
        await update.message.reply_text("تم تغيير صورة المجموعة.")
    else:
        await update.message.reply_text("يرجى الرد على صورة لتعيينها كصورة المجموعة.")

async def set_group_description(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    description = ' '.join(context.args)
    await context.bot.set_chat_description(update.message.chat.id, description)
    await update.message.reply_text("تم تغيير وصف المجموعة بنجاح.")

async def set_group_title(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    title = ' '.join(context.args)
    await context.bot.set_chat_title(update.message.chat.id, title)
    await update.message.reply_text("تم تغيير عنوان المجموعة بنجاح.")

async def get_time(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    await update.message.reply_text(datetime.now().strftime("%H:%M:%S"))

async def get_date(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    await update.message.reply_text(datetime.now().strftime("%Y-%m-%d"))

async def get_uptime(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    uptime = os.popen('uptime -p').read()
    await update.message.reply_text(f"مدة تشغيل البوت: {uptime.strip()}")

async def get_disk_usage(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    total, used, free = shutil.disk_usage("/")
    await update.message.reply_text(f"استخدام القرص: إجمالي: {total // (2**30)} GiB, مستخدم: {used // (2**30)} GiB, متاح: {free // (2**30)} GiB")

async def get_memory_usage(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    mem_info = os.popen('free -m').read()
    await update.message.reply_text(f"استخدام الذاكرة:\n{mem_info}")

async def show_group_info(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    chat = update.message.chat
    await update.message.reply_text(f"معلومات المجموعة:\nالاسم: {chat.title}\nاليوزر: {chat.username}\nالمعرف: {chat.id}")

async def show_my_info(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    user = update.message.from_user
    chat_member = await context.bot.get_chat_member(update.message.chat.id, user.id)
    user_info = (
        f"⚘ المعلومات\n"
        f"❁ الاسم: {user.full_name}\n"
        f"❁ اليوزر: @{user.username}\n"
        f"❁ الايدي: {user.id}\n"
        f"❁ الرتبه: {chat_member.status}\n"
    )
    await update.message.reply_text(user_info)

async def say(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    text = ' '.join(context.args)
    await update.message.reply_text(text)

async def avatar(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    photos = await context.bot.get_user_profile_photos(update.message.from_user.id)
    if photos.total_count > 0:
        await update.message.reply_photo(photos.photos[0][-1].file_id)
    else:
        await update.message.reply_text("لا توجد صور للملف الشخصي.")

async def report(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    if update.message.reply_to_message:
        reported_message = update.message.reply_to_message
        reported_user = reported_message.from_user
        for admin in await context.bot.get_chat_administrators(update.message.chat.id):
            await context.bot.send_message(
                admin.user.id,
                f"تم الإبلاغ عن المستخدم {reported_user.username}:\n{reported_message.text}"
            )
        await update.message.reply_text("تم الإبلاغ عن الرسالة.")
    else:
        await update.message.reply_text("يجب الرد على رسالة للإبلاغ عنها.")

async def contact(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    message = ' '.join(context.args)
    await context.bot.send_message(f"@{CHANNEL_USERNAME}", f"رسالة من {update.message.from_user.full_name} (@{update.message.from_user.username}): {message}")
    await update.message.reply_text("تم إرسال رسالتك إلى المدير.")

async def quote(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    quotes = [
        "الحياة قصيرة، عشها بسعادة.",
        "لا تحلم بالحياة، عش حلمك.",
        "العقل هو كل شيء، ما تعتقد أنك تصبح."
    ]
    quote = random.choice(quotes)
    await update.message.reply_text(quote)

async def show_admin_list(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    chat = update.message.chat
    admins = await context.bot.get_chat_administrators(chat.id)
    admin_usernames = ', '.join([f"@{admin.user.username}" for admin in admins])
    await update.message.reply_text(f"المشرفين في المجموعة: {admin_usernames}")

async def get_link(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    chat = update.message.chat
    invite_link = await context.bot.export_chat_invite_link(chat.id)
    await update.message.reply_text(f"رابط الدعوة للمجموعة: {invite_link}")

async def kick_user(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    user_id = await ensure_user_or_reply(update, context)
    if user_id:
        await context.bot.ban_chat_member(update.message.chat.id, user_id)
        await context.bot.unban_chat_member(update.message.chat.id, user_id)
        await update.message.reply_text(f"تم طرد المستخدم {user_id}.")

async def get_stats(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    chat = update.message.chat
    members_count = await context.bot.get_chat_member_count(chat.id)
    await update.message.reply_text(f"إحصاءات المجموعة:\nعدد الأعضاء: {members_count}")

async def get_banlist(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    banned_members = await context.bot.get_chat_administrators(update.message.chat.id)
    banned_list = [member.user.id for member in banned_members if member.status == 'kicked']
    if banned_list:
        await update.message.reply_text(f"قائمة المستخدمين المحظورين: {', '.join(map(str, banned_list))}")
    else:
        await update.message.reply_text("لا يوجد مستخدمين محظورين في المجموعة.")

async def mute_all(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    chat = update.message.chat
    members = await context.bot.get_chat_members(chat.id)
    for member in members:
        if member.user.id != context.bot.id:
            await context.bot.restrict_chat_member(chat.id, member.user.id, ChatPermissions(can_send_messages=False))
    await update.message.reply_text("تم كتم جميع الأعضاء في المجموعة.")

async def unmute_all(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    chat = update.message.chat
    members = await context.bot.get_chat_members(chat.id)
    for member in members:
        if member.user.id != context.bot.id:
            await context.bot.restrict_chat_member(chat.id, member.user.id, ChatPermissions(can_send_messages=True))
    await update.message.reply_text("تم فك الكتم عن جميع الأعضاء في المجموعة.")

async def purge(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    if update.message.chat.type in ['group', 'supergroup']:
        messages = [message async for message in context.bot.get_chat_history(update.message.chat.id)]
        for message in messages:
            try:
                await context.bot.delete_message(update.message.chat.id, message.message_id)
            except Exception as exp:
                logging.error(f"Error deleting message: {exp}")
        await update.message.reply_text("تم حذف جميع الرسائل.")
    else:
        await update.message.reply_text("هذا الأمر يمكن تنفيذه في المجموعات فقط.")

async def set_owner(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    user_id = await ensure_user_or_reply(update, context)
    if user_id:
        await context.bot.promote_chat_member(update.message.chat.id, user_id, 
            can_manage_chat=True, 
            can_change_info=True, 
            can_post_messages=True, 
            can_edit_messages=True, 
            can_delete_messages=True, 
            can_invite_users=True, 
            can_restrict_members=True, 
            can_pin_messages=True, 
            can_promote_members=True
        )
        await update.message.reply_text("تم تعيين المستخدم كمالك أساسي.")

async def set_co_owner(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    user_id = await ensure_user_or_reply(update, context)
    if user_id:
        await context.bot.promote_chat_member(update.message.chat.id, user_id,
            can_manage_chat=True, 
            can_change_info=True, 
            can_post_messages=True, 
            can_edit_messages=True, 
            can_delete_messages=True, 
            can_invite_users=True, 
            can_restrict_members=True, 
            can_pin_messages=True, 
            can_promote_members=True
        )
        await update.message.reply_text("تم تعيين المستخدم كمالك.")

async def set_manager(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    user_id = await ensure_user_or_reply(update, context)
    if user_id:
        await context.bot.promote_chat_member(update.message.chat.id, user_id,
            can_manage_chat=True, 
            can_change_info=True, 
            can_post_messages=True, 
            can_edit_messages=True, 
            can_delete_messages=True, 
            can_invite_users=True, 
            can_restrict_members=True, 
            can_pin_messages=True
        )
        await update.message.reply_text("تم تعيين المستخدم كمدير.")

async def set_admin(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    user_id = await ensure_user_or_reply(update, context)
    if user_id:
        await context.bot.promote_chat_member(update.message.chat.id, user_id,
            can_restrict_members=True, 
            can_delete_messages=True, 
            can_invite_users=True, 
            can_pin_messages=True
        )
        await update.message.reply_text("تم تعيين المستخدم كأدمن.")

async def clear_group_ranks(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    await update.message.reply_text("تم مسح كل الرتب.")

async def clear_welcome(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    context.bot_data['welcome'] = None
    await update.message.reply_text("تم مسح رسالة الترحيب.")

async def ban_word(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    word = ' '.join(context.args) if context.args else None
    if word:
        if 'banned_words' not in context.bot_data:
            context.bot_data['banned_words'] = []
        context.bot_data['banned_words'].append(word)
        await update.message.reply_text(f"تم منع الكلمة: {word}")
    else:
        await update.message.reply_text("يجب تحديد كلمة لمنعها.")

async def unban_word(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    word = ' '.join(context.args) if context.args else None
    if word:
        if 'banned_words' in context.bot_data and word in context.bot_data['banned_words']:
            context.bot_data['banned_words'].remove(word)
            await update.message.reply_text(f"تم السماح بالكلمة: {word}")
        else:
            await update.message.reply_text(f"الكلمة {word} غير ممنوعة")
    else:
        await update.message.reply_text("يجب تحديد كلمة للسماح بها.")

async def kick_bots(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    chat = update.message.chat
    bots = [member.user for member in await context.bot.get_chat_administrators(chat.id) if member.user.is_bot]
    for bot in bots:
        await context.bot.ban_chat_member(chat.id, bot.id)
    await update.message.reply_text("تم طرد جميع البوتات من المجموعة.")

async def check_bots(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    chat = update.message.chat
    bots = [member.user for member in await context.bot.get_chat_administrators(chat.id) if member.user.is_bot]
    if bots:
        bot_names = ', '.join([bot.username for bot in bots])
        await update.message.reply_text(f"البوتات في المجموعة: {bot_names}")
    else:
        await update.message.reply_text("لا يوجد بوتات في المجموعة.")

async def bio(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    user = update.message.from_user
    await update.message.reply_text(f"بايو المستخدم: {user.bio}")

async def random_bio(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    bios = ["بايو 1", "بايو 2", "بايو 3"]  # يمكن تحديث هذه القائمة بمزيد من البيوس العشوائية
    bio = random.choice(bios)
    await update.message.reply_text(f"بايو عشوائي: {bio}")

async def id(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    user = update.message.from_user
    await update.message.reply_text(f"ايدي الخاص بك: {user.id}")

async def creation_date(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    chat = update.message.chat
    chat_info = await context.bot.get_chat(chat.id)
    await update.message.reply_text(f"تاريخ الإنشاء: {chat_info.created_date}")

async def my_groups(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    user = update.message.from_user
    groups = []  # هنا يجب أن يتم الاحتفاظ بقائمة المجموعات الخاصة بهذا المستخدم
    await update.message.reply_text(f"المجموعات الخاصة بك: {', '.join(groups)}")

async def admin(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    await update.message.reply_text(f"الاتصال بالأدمن: @{CHANNEL_USERNAME}")

async def transfer_ownership(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    if update.message.reply_to_message:
        new_owner = update.message.reply_to_message.from_user
        await update.message.reply_text(f"تم نقل الملكية إلى {new_owner.mention_html()}", parse_mode='HTML')
    else:
        await update.message.reply_text("يجب الرد على رسالة المستخدم لنقل الملكية.")

async def avatar_by_user(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    if not await check_subscription(update, context):
        return

    user_id = await ensure_user_or_reply(update, context)
    if user_id:
        photos = await context.bot.get_user_profile_photos(user_id)
        if photos.total_count > 0:
            await update.message.reply_photo(photos.photos[0][-1].file_id)
        else:
            await update.message.reply_text("لا توجد صور للملف الشخصي لهذا المستخدم.")
    else:
        await update.message.reply_text("يجب الرد على رسالة المستخدم أو إدخال معرفه.")

async def unknown_command(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    pass  # لا تعرض أي رسالة عند استخدام أمر غير معروف

async def main() -> None:
    logging.info("Starting bot...")
    application = ApplicationBuilder().token(TOKEN).build()
async def handle_message(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    text = update.message.text.lower()

    # التحقق من وجود النص في القاموس والرد
    if text in responses:
        await update.message.reply_text(responses[text])
    else:
        # إذا لم يكن النص موجودًا في القاموس، قم بمعالجة الرسائل الأخرى
        if text in ["حظر", "ban"]:
            await ban_user(update, context)
        elif text in ["فك الحظر", "unban"]:
            await unban_user(update, context)
        elif text in ["كتم", "mute"]:
            await mute_user(update, context)
        elif text in ["الغاء كتم", "unmute"]:
            await unmute_user(update, context)
        elif text in ["تحذير", "warn"]:
            await warn_user(update, context)
        elif text in ["تعين قواعد", "setrules"]:
            await set_rules(update, context)
        elif text in ["عرض قواعد", "rules"]:
            await get_rules(update, context)
        elif text in ["الوقت", "time"]:
            await get_time(update, context)
        elif text in ["تاريخ", "date"]:
            await get_date(update, context)
        elif text in ["مده تشغيل", "uptime"]:
            await get_uptime(update, context)
        elif text in ["المساحه", "disk"]:
            await get_disk_usage(update, context)
        elif text in ["ذاكره", "memory"]:
            await get_memory_usage(update, context)
        elif text in ["رفع مشرف", "promote"]:
            await promote(update, context)
        elif text in ["ازاله صلاحيات", "demote"]:
            await demote(update, context)
        elif text in ["قول", "say"]:
            await say(update, context)
        elif text in ["معلومات", "group_info"]:
            await show_group_info(update, context)
        elif text in ["معلوماتي", "info"]:
            await show_my_info(update, context)
        elif text in ["صوره", "avatar"]:
            await avatar(update, context)
        elif text in ["ابلاغ", "report"]:
            await report(update, context)
        elif text in ["مدير", "contact"]:
            await contact(update, context)
        elif text in ["اقتباس", "quote"]:
            await quote(update, context)
        elif text in ["قائمه المشرفين", "adminlist"]:
            await show_admin_list(update, context)
        elif text in ["تعين صوره", "pic"]:
            await set_group_picture(update, context)
        elif text in ["تعين وصف", "desc"]:
            await set_group_description(update, context)
        elif text in ["تعين عنوان", "title"]:
            await set_group_title(update, context)
        elif text in ["رابط دعوه", "link"]:
            await get_link(update, context)
        elif text in ["طرد", "kick"]:
            await kick_user(update, context)
        elif text in ["احصائيات", "stats"]:
            await get_stats(update, context)
        elif text in ["المحظورين", "banlist"]:
            await get_banlist(update, context)
        elif text in ["كتم الكل", "muteall"]:
            await mute_all(update, context)
        elif text in ["الغاء كتم الكل", "unmuteall"]:
            await unmute_all(update, context)
        elif text in ["مسح جميع رسائل المجموعه", "purge"]:
            await purge(update, context)
        elif text in ["رفع مالك", "set_owner"]:
            await set_owner(update, context)
        elif text in ["رفع مشارك للمالك", "set_co_owner"]:
            await set_co_owner(update, context)
        elif text in ["رفع مدير", "set_manager"]:
            await set_manager(update, context)
        elif text in ["رفع ادمن", "set_admin"]:
            await set_admin(update, context)
        elif text in ["مسح جميع الرتب", "clear_group_ranks"]:
            await clear_group_ranks(update, context)
        elif text in ["مسح رساله ترحيب", "clear_welcome"]:
            await clear_welcome(update, context)
        elif text in ["حظر كلمه معينه", "ban_word"]:
            await ban_word(update, context)
        elif text in ["الغاء حظر كلمه معينه", "unban_word"]:
            await unban_word(update, context)
        elif text in ["طرد جميع البوتات", "kick_bots"]:
            await kick_bots(update, context)
        elif text in ["عرض بوتات", "check_bots"]:
            await check_bots(update, context)
        elif text in ["عرض بايو", "bio"]:
            await bio(update, context)
        elif text in ["عرض بايو عشوائي", "random_bio"]:
            await random_bio(update, context)
        elif text in ["عرض id", "id"]:
            await id(update, context)
        elif text in ["عرض تاريخ انشاء", "creation_date"]:
            await creation_date(update, context)
        elif text in ["عرض مجموعات", "my_groups"]:
            await my_groups(update, context)
        elif text in ["تواصل مع الادمن", "admin"]:
            await admin(update, context)
        elif text in ["نقل ملكيه", "transfer_ownership"]:
            await transfer_ownership(update, context)
        elif text in ["عرض صوره", "avatar_by_user"]:
            await avatar_by_user(update, context)

import logging

async def main() -> None:
    logging.info("Starting bot...")  # أضف هذا السطر
    application = ApplicationBuilder().token(TOKEN).build()

    # إضافة الأوامر باللغتين
    application.add_handler(CommandHandler("start", start))
    application.add_handler(CommandHandler("help", help_command))
    application.add_handler(CommandHandler("commands_arabic", commands_arabic))  # استخدام أمر بالإنجليزية لعرض الأوامر بالعربية

    application.add_handler(MessageHandler(filters.TEXT & ~filters.COMMAND, handle_message))
    application.add_handler(MessageHandler(filters.COMMAND, unknown_command))

    nest_asyncio.apply()
    await application.run_polling()

if __name__ == '__main__':
    try:
        loop = asyncio.get_running_loop()
        logging.info("Got the running loop.")
    except RuntimeError:
        loop = None

    if loop and loop.is_running():
        loop.create_task(main())
    else:
        asyncio.run(main())
